[
  {
    "title": "B.A. LL.B. (Hons.) Programme Overview",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-overview",
    "content": "The B.A. LL.B. (Hons.) is a five-year (10 semesters) undergraduate degree programme that integrates Liberal Arts with Law. It is designed to provide students with a strong foundation in a diverse range of subjects, both legal and non-legal, fostering a holistic understanding of the legal landscape. The programme holds a rating of ⭐ 4.3 based on 18 reviews, indicating generally positive student feedback. Key highlights include an Interdisciplinary Approach with a balanced combination of classroom learning, mock court drills, case studies, research work, and law internships. It emphasizes Skill Development like legal research, advocacy, drafting, critical thinking, communication, and problem-solving. The curriculum encourages students to explore Global Legal Contexts. The programme is Approved by the Bar Council of India (BCI) and University Grants Commission (UGC)."
  },
  {
    "title": "B.A. LL.B. (Hons.) Specialisations and Curriculum Structure",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-curriculum",
    "content": "The B.A. LL.B. (Hons.) programme offers specialisations in Corporate Law and Criminal Law. The curriculum spans 10 semesters, blending compulsory Law and Non-Law subjects with elective and honours elective options. Compulsory subjects include Law of Torts, Law of Contract-I & II, Political Science I & II, Sociology I & II, Economics I & II, Legal English I & II (Early Semesters); Constitutional Law I & II, Family Law I & II, Law of Crimes I & II, Property Law, Administrative Law, Company Law, Laws of Criminal Procedure, Law of Evidence, Environmental Law, Civil Procedure Code and Limitation Act, Labour Laws, Jurisprudence (Mid-Programme); and Land Laws, Intellectual Property Rights Law I & II, Drafting, Pleading and Conveyancing, Public International Law & Human Rights, Information Technology & Telecommunications Law, Professional Ethics and Professional Accounting System, Moot Court Exercise and Internship (Later Semesters). Elective and Honours Elective examples include Cyber Law, Private International Law, Law on Mergers and Acquisitions, Juvenile Justice, Banking & Insurance Law, and International Criminal Law. Unique curriculum elements include Integration of STEM in foundation years, strong emphasis on Experiential Learning (mock court drills, case studies, research work, internships), and compulsory foreign language courses (Spanish, German, French)."
  },
  {
    "title": "B.A. LL.B. (Hons.) Admission Requirements and Fees",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-admission",
    "content": "Eligibility for the B.A. LL.B. (Hons.) programme requires a pass in the 10+2 examination with at least 50% or more marks in aggregate in 5 subjects, and English as a qualified subject. Admission is based on merit from scores in SAT/ CLAT/ MRNAT 2024 / Pearson/ 10+2 Qualifying Examination. Indian/NRI/PIO/Foreign nationals are eligible. The annual course fee is INR 2,44,000 or US $4,000. Scholarships up to 100% are available based on MRNAT, CLAT Scores, 12th marks, and sports. Haryana Govt. scholarship is also offered to Haryana domicile students whose parental income is less than INR 2.8 lacs per Annum. To apply, visit www.manavrachna.edu.in, fill the Online Application Form, upload required documents (Class 10 & 12 mark sheets, Aadhaar card, passport-size photographs), pay the Application Fee online, and appear for MRNAT or submit CLAT/SAT Score. Fee payment modes include Online payment, Bank Transfer (NEFT/RTGS), Demand Draft (DD), Cash Payment (at Accounts Office), and Education Loan (through tie-ups with PNB, SBI, HDFC, ICICI)."
  },
  {
    "title": "B.A. LL.B. (Hons.) Career Pathways and Industry Exposure",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-careers",
    "content": "The B.A. LL.B. (Hons.) programme prepares students for a strong foundation for a lucrative career with multiple career options, highlighted as unmatched by any other professional degree. Potential career pathways include Litigation (practicing in District Courts, High Courts, and the Supreme Court of India), Civil Services (UPSC, Judicial Services, Armed Forces - Judge Advocate General), Legal Firms, Corporate Sector (in-house counsels, compliance officers, legal departments in MNCs, Legal officers for Banks and Insurance Companies), Alternative Legal Careers (NGOs, Legal Editor, Legal Journalist, LPOs, KPOs), Academia (as industry experts), and Evolving Fields like Technology law, artificial intelligence, environment and sustainable development, and entertainment laws."
  },
  {
    "title": "B.A. LL.B. (Hons.) Unique Selling Propositions (USPs)",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-usps",
    "content": "The School of Law emphasizes a practical and comprehensive approach to legal education. Key educational benefits include providing a Professional Degree for a lucrative career, Comprehensive Knowledge of Law and Rights, and fostering Critical Thinking and Reasoning Abilities, alongside the inherent Prestige and Respect of a legal profession. Specific USPs include Faculty from top-notch institutions (NLUs, JNU, foreign Universities), Experiential Learning (‘Learning by Doing’), an Advisory Council headed by Hon’ble Former Chief Justice Uday Umesh Lalit, various Centres of Excellence and Research Groups (e.g., Corporate Law and ADR, Legislative Studies and Research), strong linkages with industry, corporates, law firms, and Senior Advocates to facilitate internships and placements, State-of-art infrastructure, Emphasis on Clinical Legal Education, 100% internship and placement assistance through a dedicated Department of Training and Placements, strong emphasis on professional training and holistic personality development, and student participation in national and international moot court competitions, client counselling, mediation competitions, and conferences."
  },
  {
    "title": "B.A. LL.B. (Hons.) Internships and Placements",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-internships-placements",
    "content": "The university provides 100% internship and placement assistance for the B.A. LL.B. (Hons.) programme. Top Recruiters mentioned, also appearing under 'Internship & Placement Opportunities,' include Amazon, Nokia, Infosys, Pinkerton, Apple, Boeing, Capital One, Cisco, Federal Reserve Bank of New York, General Motors, Intel, Lockheed Martin, Northrop Grumman, and Patient First. Students engage in Summer Internships of a minimum of 4 weeks after Semesters IV, VI, and VIII, with corresponding Internship Viva sessions (I, II, III, IV, V)."
  },
  {
    "title": "B.A. LL.B. (Hons.) Student Life and Facilities",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-student-life-facilities",
    "content": "Manav Rachna University provides a vibrant student life and comprehensive facilities for B.A. LL.B. (Hons.) students. Residential Services include on-campus and off-campus hostel accommodation for boys and girls, with various room categories (AC/Non-AC, single/double/triple/five-seater) and attached/common bathrooms. Hostel fees cover medical facilities, medical insurance, library access, and laundry. A mess plan is also included in hostel fees. Sports Facilities are world-class for outdoor and indoor games, featuring basketball, volleyball, cricket, shooting (25m and 10m indoor range), table tennis, squash, billiards, soccer, chess, carom, indoor badminton and table tennis stadia with synthetic courts, a Sports Fitness Centre, Soccer Academy, and a Semi Olympic-sized swimming pool. Transport is well-organized with GPS-enabled buses for students commuting from Delhi and Gurugram, prioritizing punctuality, safety, and convenience. Cultural Societies cater to diverse interests, including Performing Arts (Khalbali - Dramatics, Moksh - Music, Rudra - Dance), Creative & Media (Noora - Fashion, Drishti - Media, Felicia - Art), Literary & Personal Development (Rehnuma - Literary, Karisma & TechSoul - Personality Development), and Recreational (GAMENIX - Gaming)."
  },
  {
    "title": "B.A. LL.B. (Hons.) Global Exposure and Innovation",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-global-innovation",
    "content": "The B.A. LL.B. (Hons.) programme at Manav Rachna University emphasizes global exposure and innovation. International Tie-ups and collaborations aim to provide a global perspective on legal education, promote cross-cultural understanding, and facilitate international research and exchange programs. A specific collaboration with The University of Waikato, New Zealand, allows MRU UG Law students to progress to PG study options (LLM, MLS, MJur) at Waikato. Innovation & Startups are fostered through the Manav Rachna Business Incubator, which nurtures the innovative instinct of students, alumni, and faculty. It provides design, fabrication, and manufacturing facilities, offers a good path to capital from angel investors, state governments, and other investors, and includes mentorship, expertise, and networking, along with integrated, customized Innovation-Based Incubation support services."
  },
  {
    "title": "B.A. LL.B. (Hons.) Student Testimonials and Best Practices",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-testimonials-best-practices",
    "content": "Student testimonials for the B.A. LL.B. (Hons.) programme highlight positive experiences regarding faculty, opportunities, and overall development. Tejaswi Dudeja describes her experience as 'a perfect blend of joy and learning,' praising the faculty. Yash Batra emphasizes the 'wonderful experience of learning with prolific exposure to the outside' and the helpfulness of the Commercial Arbitration course for his practice. Best Practices include Legal Aid Camps/Activities, with annual participation in legal awareness programmes with District Legal Service Authority (DLSA) and Haryana Legal Service Authority (HLSA). The MR Radio Session Legal Awareness Program utilizes radio broadcasts to disseminate legal information in neighborhood villages, overcoming literacy and infrastructure barriers, and addressing community concerns directly."
  },
  {
    "title": "B.A. LL.B. (Hons.) Programme Outcomes (POs) and Program Specific Outcomes (PSOs)",
    "start_page": 0,
    "chunk_id": "ba-llb-hons-outcomes",
    "content": "The B.A. LL.B. (Hons.) programme at Manav Rachna University aims to develop a range of competencies in students. Program Specific Outcomes (PSOs) include the ability to Examine and assess the role of people and societal institutions in shaping laws and their effect on society (PSO1), and the capacity to Critically analyze socio-legal gaps and propose measures to fill inequities, protecting the ethos of the rule of Law (PSO2). Broader Program Outcomes (POs) encompass Knowledge of Law (PO1 - fundamental principles, basic legislations, leading cases), Communication Skills (PO2 - effective written and oral communication, analytical reading/writing, concise presentation), Critical Thinking (PO3 - analyzing/evaluating evidence and arguments, identifying assumptions, formulating coherent arguments), Problem Solving (PO4 - applying competencies to solve legal problems), Analytical Reasoning (PO5 - evaluating reliability of evidence, identifying logical flaws, analyzing/synthesizing data, drawing valid conclusions), Research-related Skills (PO6 - inquiry, questioning, synthesizing, articulating, planning/executing investigations), Moral and Ethical Awareness/Reasoning (PO7 - embracing ethical values, formulating arguments on ethical issues, avoiding plagiarism, appreciating environmental issues, objectivity), Professional Advocacy and Consultancy (PO8 - carrying out professional advocacy and consultancy, representing clients professionally), Digital Literacy (PO9 - using ICT for learning, accessing/evaluating information, using software for data analysis), and Self-directed Learning (PO10 - working independently, identifying resources, managing projects to completion)."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Programme Overview",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-overview",
    "content": "The Bachelor of Technology (B.Tech) Computer Science and Engineering (Hons.) with a specialisation in Artificial Intelligence & Machine Learning (AIML), offered in association with Xebia, is an undergraduate programme designed to equip students with core computer science principles and advanced AI studies to tackle real-world challenges. This briefing document outlines its key features and benefits."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Curriculum Structure and Key Modules",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-curriculum",
    "content": "The curriculum for B.Tech CSE (Hons.) AIML with Xebia integrates core computer science with specialised AI/ML topics, along with interdisciplinary and soft skill development courses. Semester 3 Highlights include Core Programming: Object Oriented Programming Using Java; Data Management: Database Management System; Software Development: Software Engineering; Foundation: Discrete Mathematics; Web Technologies: USER INTERFACE-II (MONGODB, TYPESCRIPT, ANGULAR JS); and AI/ML Specific: Supervised Learning (Fundamentals and application). Semester 4 deepens into core computer science with Artificial Intelligence (theory and lab), Operating Systems (theory and lab), FUNDAMENTALS OF DIGITAL ELECTRONICS, and Computer Networks (theory and lab). Specialised options continue with Unsupervised Learning (theory and lab)."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Admission Requirements and Scholarships",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-admission",
    "content": "Eligibility for B.Tech CSE (Hons.) AIML includes 60% marks in a 3-year Diploma in Engineering (any branch/discipline) from State Board of Technical Education, Haryana or equivalent, OR a B.Sc. Degree from a recognised UGC University with at least 50% marks, and XII standard with Mathematics as a subject. Admission is merit-based, requiring appearance for MRNAT (Manav Rachna National Aptitude Test) or submission of a valid JEE Main score. Scholarships up to 100% are provided for meritorious students and sportspersons."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Placements",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-placements",
    "content": "The B.Tech CSE (Hons.) AIML programme offers significant placement support, including notable international placements. Examples of international placements include Karan Aditya Ghoshal (KPMG, Canada - 60 LPA), Sarthak Rastogi (Space and Time Labs, USA - 55 LPA), Deepanshu Sharma (équipe Nutrition Canada - 30 LPA), and Ananya Kamra (Alto Palo Networks - 51 Lakhs). Student grooming for placement readiness is facilitated through Career Development Cell (CDC) experts, and 'Super 40 batches' are available for dedicated placement support. Access to e-learning platforms like MOOC, NPTEL, Coursera, Infosys Springboard, LinkedIn Learning, UI Path, MongoDB, Xebia, and Google further enhances employability."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Research & Innovation Focus",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-research-innovation",
    "content": "The B.Tech CSE (Hons.) AIML programme emphasizes research and innovation. It includes an 'Introduction to Research' sequence of courses from the 3rd to 5th semester, focusing on originality, feasibility for start-ups, and documentation of outcomes (research paper, patent, product, start-up, copyright). The university boasts '6 Centre of Excellence' and over '200 research papers in international and refereed journals,' providing opportunities for patents, copyrights, funded projects, consultancy, and student start-ups. It actively promotes Design Thinking & Innovation and acts as a Research & Innovation Catalyst. Students can connect with faculty-led research groups in areas like Data Analytics, Communication Networks, AI, Web Technologies, Data Mining, and Network Security, with access to National and International online journals (IEEE, Springer, DELNET, CSI) and e-library facilities, along with support for writing research papers and filing patents."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Employability Enhancement",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-employability",
    "content": "Employability enhancement for B.Tech CSE (Hons.) AIML students is achieved through skill-based training via MOUs and student grooming for placement readiness by Career Development Cell (CDC) experts. 'Super 40 batches' offer specialized placement support, and students have access to a wide range of e-learning platforms including MOOC, NPTEL, Coursera, Infosys Springboard, LinkedIn Learning, UI Path, MongoDB, Xebia, and Google."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Curriculum Design and Learning Approach",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-curriculum-design",
    "content": "The curriculum for B.Tech CSE (Hons.) AIML is co-designed, co-delivered, and co-certified by industry experts and reputed academicians, following an AICTE model curriculum with industry-oriented choice-based courses. This approach aims to bridge the gap between industry and academia and incorporate new technology for skilled manpower requirements. The learning approach emphasizes 'learning-by-doing,' supported by 09 fully equipped state-of-the-art laboratories, hands-on lab workshops, and Project and experiential-based learning. Faculty utilize a STEP (Simulated Teaching Enabled Programmes) methodology."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Core Computer Science and Emerging Technologies",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-core-tech",
    "content": "The B.Tech CSE (Hons.) AIML curriculum covers foundational Core Computer Science subjects such as Object-Oriented Programming (Java, Python), Database Management Systems, Software Engineering, Operating Systems, Computer Networks, Computer Architecture & Organization, Analysis and Design of Algorithms, and Theory of Automata & Compiler Design. It also delves into Emerging Technologies, including Artificial Intelligence, Machine Learning (Supervised, Unsupervised), Deep Learning, and Neural Networks & Fuzzy systems."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Strong Industry Associations and Facilities",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-industry-facilities",
    "content": "A significant highlight of the B.Tech CSE (Hons.) AIML programme is its strong industry associations with giants like Google Cloud, MongoDB, and UI Path, which influence curriculum design, training, internships, and placements to ensure industry-ready graduates. The program is supported by State-of-the-Art Facilities, including nine fully equipped state-of-the-art laboratories. The curriculum adheres to the AICTE model curriculum with industry-oriented, choice-based courses, emphasizing skill-based training through MOUs and access to e-learning platforms like MOOC, NPTEL, Coursera, Infosys Springboard, LinkedIn Learning, UI Path, MongoDB, and Xebia."
  },
  {
    "title": "B.Tech CSE (Hons.) AIML (Xebia) Student Life and Facilities",
    "start_page": 0,
    "chunk_id": "btech-aiml-xebia-student-life-facilities",
    "content": "Student life and facilities for B.Tech CSE (Hons.) AIML students include World-class Sports facilities for outdoor and indoor games, featuring a 25m/10m Shooting Range, indoor badminton and table tennis stadia, a Sports Fitness Centre, Soccer Academy, and a Semi Olympic-sized swimming pool. A well-organized Transport facility with GPS-enabled buses ensures safe and reliable commutes for students from Delhi and Gurugram. Extra-Curricular Activities emphasize experiential, participative, and problem-based learning methodologies through numerous cultural societies: Khalbali (Dramatics), Moksh (Music), Rudra (Dance), Noora (Fashion), Drishti (Media), Rehnuma (Literary), Karisma & TechSoul (Personality Development), and GAMENIX (Gaming). Innovation & Startups are nurtured by the Manav Rachna Business Incubator, providing design, fabrication, manufacturing facilities, access to capital, mentorship, and networking. The university boasts 50+ global partnerships and 90+ Corporate Tie-Ups, ensuring 100% industry exposure. Best Practices include a National Innovation and Startup Policy encouraging tech-driven startups, academic flexibility for student entrepreneurs, and patent filing and IPR protection, alongside E-Waste Management for Sustainability through collection drives and eco-friendly design promotion."
  },
  {
    "title": "MBA in Business Analytics (IoA, UK) Programme Overview and Core Focus",
    "start_page": 0,
    "chunk_id": "mba-business-analytics-overview",
    "content": "The Master of Business Administration (MBA) in Business Analytics program, offered by the Department of Electronics and Communication Engineering at Manav Rachna University (MRU) in association with The Institute of Analytics (IoA), UK, is a skill-oriented program specifically designed to equip students with future-oriented data handling capabilities. It focuses on hands-on training utilizing the latest Business intelligence software, tools, and languages like R-Studio, Python & Tableau etc. The curriculum is future-oriented, catering to both current and future industrial requirements, with core courses such as Data Mining, Data Visualization, Big Data Analytics, Web Analytics, Marketing and Retail analytics, and Operation and Business Analytics. Semester 3 courses include Internet of Things (IoT), Big Data, Mobile Application and Services, Operations Research, Non-Conventional Energy Sources, and Machine Learning. Semester 4 is dedicated to a Dissertation Project."
  },
  {
    "title": "B.Tech Robotics & AI Programme Overview",
    "start_page": 0,
    "chunk_id": "btech-robotics-ai-overview",
    "content": "The B.Tech Robotics & AI programme prepares graduates for diverse roles such as Robotics Engineer, AI/ML Developer, Automation Engineer, AI Research Scientist, Robotics System Architect, and AI/Robotics Consultant, across private (IBM, TCS, Microsoft, Amazon, Google, Flipkart) and government sectors (Banking, PSUs like BSNL, DRDO, ISRO). The programme boasts nine state-of-the-art laboratories, including specialised robotics labs with equipment like PLC-controlled robotic arms, industrial automation setups with conveyor belts and Dobot robots, drones with LiDAR modules, and an AICTE-setup 'AeroVision Drone Lab' worth 50 Lakhs. To apply, visit www.manavrachna.edu.in, fill out the online application form, upload required documents (Class 10 & 12 mark sheets, Aadhaar card, and passport-size photographs), and pay the application fee online. Appear for MRNAT (Manav Rachna National Aptitude Test) or submit a valid JEE Main score for merit-based admission."
  },
  {
    "title": "BCA in Cloud Computing (Google) Programme Overview",
    "start_page": 0,
    "chunk_id": "bca-cloud-computing-overview",
    "content": "The BCA in Cloud Computing at Manav Rachna University, with significant collaborations with leading technology companies like Google, offers a robust, industry-aligned programme with a strong emphasis on practical skills. The curriculum is co-designed and provides free access to Google Cloud Gen AI Skill Badge Pathways and other certifications (Associate Cloud Engineer, Cloud Digital Leader, Cybersecurity, Data Analytics, Cloud Computing Foundations, Cloud Engineer), along with access to the Google Cloud Skill Boost Platform. Career opportunities include access to Placement Fairs by Google for certified students. The programme also provides advanced learning tools such as virtual tutors, automated content generation and summarization, and exclusive hackathons with Google experts. The faculty are Google Certified for curriculum delivery. This comprehensive curriculum, state-of-the-art facilities, dedicated student support, and a proven track record of student achievements position it as an attractive option for aspiring cloud professionals. Key subjects include Wireless Sensor Network Data Preparation and Analysis, Cloud Computing, User Experience, Data Visualization and Tableau, and Mini Project with Seminar. Semester 3 courses include Internet of Things (IoT), Big Data, Mobile Application and Services, Operations Research, Non-Conventional Energy Sources, and Machine Learning. Semester 4 is dedicated to a Dissertation Project."
  },
  {
    "title": "B.Tech Mechanical Engineering with Smart Manufacturing and Automation (L&T Edutech) Programme Overview",
    "start_page": 0,
    "chunk_id": "btech-mechanical-smart-manufacturing-overview",
    "content": "The B.Tech Mechanical Engineering with Smart Manufacturing and Automation programme has a curriculum co-designed, co-delivered, and co-certified with industry experts, notably with L&T Edutech, ensuring its relevance to current industry trends. It follows a Choice Based Credit System (CBCS), allowing for elective subjects. Key subjects and technological integrations include Mechanical Engineering Fundamentals (Fluid Mechanics, Thermodynamics, Materials Science, Theory of Machines, Machine Design, Heat Transfer, Refrigeration and Air Conditioning, Strength of Materials) and Automation and Digital Technologies (Mechatronics, Industrial Automation, Robotics, CNC Programming, Smart Sensors and Actuators, PLC and SCADA Systems, Cyber-Physical Systems (CPS), Data Analytics for Manufacturing). The program provides state-of-the-art infrastructure including '09 fully equipped state-of-the-art laboratories,' a Research Cluster of Computing Lab (RCC), and Agile Classrooms. It emphasizes holistic student development through dedicated student mentoring throughout the program, offering career guidance and support, while also fostering the development of moral and ethical values."
  }
]