[
  {
    "title": "Manual Entry",
    "start_page": 0,
    "chunk_id": "manual-attendance",
    "content": "The minimum attendance required for a student in a semester is 75%. Failing to meet this requirement will result in the student needing to re-apply for the course in the next odd or even semester."
  },
  {
    "title": "Manual Entry",
    "start_page": 0,
    "chunk_id": "manual-clanpoints",
    "content": "To earn a degree, students must earn at least 25 activity points per year through extra-curricular, co-curricular, innovation, or CSR activities. These points translate into 2 credits for UG and 1 credit for PG programs and are reflected on the grade card. Clan activities help build skills like communication and project management."
  },
  
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-1",
    "content": "1585(iii) 1 MANAV RACHNA UNIVERSITY FARIDABAD MRU (EXAMINATION) REGULATION, 2022 Approved by Board of Management in its 20th Meeting held on 17.12.2022 2 MRU (EXAMINATION) REGULATION, 2022 In pursuance of the provisions under Section 34 of the Haryana Private Universities Act, 2006, the Board of Management of the Manav Rachna University hereby makes the following Regulations relating conduct of examination of the University. 1. Short Title and Application (i) This Regulations may be called MRU (Examination) Regulation, 2022 (ii) This shall come in force from the date of approval of the Board of Management (iii) This shall apply to all the Programs offered in the University. (iv) This shall supersede the MRU (Conduct of Examination) Regulation, 2020 2. General Guidelines (i) Examinations of the University shall be open to all students' who have registered in those subjects and meet all other requirement for taking the examination. The Rules and Regulations with regard to examinations shall be applicable to all the students who are studying in the University in any mode (online/offline/hybrid). (ii) The student should have cleared all the fee and other dues before the admit card is issued to him/her. (iii) A student has to fulfill the attendance requirement and satisfy all the provisions of this regulations or/and any other regulations which govern the permission to appear in the examination; (iv) Any person who has been expelled or rusticated from the University or has been debarred from appearing in the University examination for any reason shall not be permitted for any examination during the period for which the sentence is in operation. (v) The permission to appear in examination may be withdrawn, if it is found that: (a) the hall ticket was issued erroneously; (b) the student was not eligible to appear in the examination; (c) any of the"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-2",
    "content": "particulars or document submitted by the student at any stage (be it enrolment, admission or registration etc) are found to be false or incorrect. (vi) A student shall produce his/her Identity card whenever required by the Controller of Examination (COE) or any person authorized by him/her. (vii) A student shall have to abide by the rules and regulations for maintaining the discipline both outside & inside the Examination Hall. In the event of the student disobeying the instructions, or continues with his/her undisciplined conduct or insolent behavior, he/she may be removed from the hall and disallowed the day's examination. If he/she persists in misbehavior; he/she may be debarred from the rest of the examinations. 3 (viii) Every such case with full details shall be reported to the office of the Controller of Examination and as deemed fit depending upon the gravity of the offence, may send the case to the Disciplinary Committee for further necessary action. (ix) The Disciplinary committee depending upon the gravity of the case may recommend cancellation of his/her examination and/or debar him/her from appearing in the examination for such period as it finds appropriate after giving the student a reasonable opportunity of being heard. If a student acts in a violent manner or uses force or makes a display of force inside the Hall / Examination room or endanger the personal safety or acts in a manner threatening the officials in the discharge of their duties or brings any dangerous weapon within the precincts of the examination hall the student may be expelled from the hall and/or handed over to the police, if required. (x) A student who is unable to appear in the examination due to sickness or any other reasons, such case may be treated as a special case after satisfying about the genuineness"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-3",
    "content": "of the case. The COE may take appropriate remedial measures including special examination for all such cases. (xi) An amanuensis shall be allowed in the following cases (a) blind students; (b) the students who are disabled due to an accident or disease; (c) candidates having impairment of movement in arms and hands can read independently but have problem in writing; (d) locomotor impaired and cerebral palsy student; (e) sudden illness rendering the candidate unable to write; (f) an accident involving injury rendering the candidate unable to write the examination with their own hands. 3. CONDUCT OF EXAMINATION (i) At the beginning of each Academic Session and normally not later than one month of beginning of the semester of every calendar year, the University shall prepare and publish a semester wise or annual schedule of examinations for each program conducted by it as per the provisions under the section 37 of Haryana Private Universities Act, 2006. (ii) The Controller of Examination shall prepare and duly publish a Date sheet for examinations as per the Academic Calendar of the program. All arrangements for the conduct of examination to be held by the University shall be made by the Controller of Examination in accordance with such directions as may be issued from time to time. (iii) For theory as well as practical examinations and dissertation /project report / training report all examiners shall be appointed by the Controller of Examinations, on the recommendation Board of Studies concerned and with the approval by the Vice- Chancellor. (iv) The Controller of Examination shall make all necessary arrangements for conduct of examination. It shall also notify the mode of examination including open book or any 4 other type of examination as recommended by the Board of Studies of the concerned department / School. The reference material"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-4",
    "content": "as required for answering questions as proposed by the examiner may also be provided. (v) The centre superintendent shall decide the rooms for the examinations and shall issue proper instructions and seating plan. (vi) Controller of Examination shall be personally responsible for the safe custody of question papers and the answer-books sent to him/her. (vii) The Controller of Examination shall supervise the work of Invigilators and shall conduct the examination strictly, according to the instructions as per regulations. (viii) The Controller of Examination shall after every end examination send a confidential report to the Vice Chancellor about the conduct of examination, mentioning therein the performance of the Invigilators and the general behavior of the examinees. The Controller of Examination based on the report of superintendent, shall also prepare a daily report on the number of examinees attending each of the Examinations, absentee numbers and such other information relating to the examinations being held at the different examination halls as may be considered necessary, along with any other matter which he/she thinks fit to be brought to the notice of the Vice-Chancellor. (ix) Normally teachers of the University shall be appointed as Invigilators by the Controller of Examination unless otherwise required, provided that a teacher of the subject of the written examination at any session shall not be an Invigilator at such session of the examination but shall be available for any clarification. (x) It shall be the duty of Invigilators to ensure the correct identity of the student. For this each student will carry the valid identity card and admit card issued by the University. (xi) The University may appoint flying squads, if required to see that the conduct of the examination is strictly according to the rules and procedures laid down. In the event of the flying squads point"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-5",
    "content": "out any serious breach of examination rules and procedures, the Vice-Chancellor may take such action as may be necessary including postponement or cancellation, wholly or in part, of the examination. (xii) The Controller of Examination may, with the approval of the Vice-Chancellor, cancel an examination at all hall/locations, if he/she is satisfied that there has been a leakage of question papers or any other irregularity which puts a question mark on the sanctity / credibility of examination, which warrants such action. (xiii) The Controller of Examination shall issue such general instructions for the guidance of the Examiners, Tabulators, Collators, as he /she considers necessary for proper conduct of examination. (xiv) Subject to the provisions of this Regulations, the Controller of Examination, in consultation with the University Examination Committee may suggest to the Academic Council for modification of rules and procedures as deemed necessary for effective conduct of examination. (xv) Every student has to appear in exam of theory and practical for getting a grade in a course. Failing which he / she has to appear in a supplementary examination and shall be governed by the rules of supplementary examination, as approved from time to time. 5 (xvi) The student who have cleared his/her subject(s) in supplementary examination shall be awarded a maximum grade of B+ (equivalent to 55%). However, for special cases as mentioned under clause 2(x), the maximum grades that a student can obtained shall be A+ (75%). 4. NOTIFICATION OF SCHEDULE OF FEES The University shall notify the fees payable by the students with timeline such as re- checking, re-evaluation, supplementary examination, duplicate grade card / transcript etc. 5. PREPARATION AND DECLARATION OF RESULT: (i) Course Coordinator, who is usually a faculty member teaching the course, shall coordinate the submission of marks/course file of the evaluation to the"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-6",
    "content": "office of Controller of Examination. (ii) Course Coordinator shall submit to the Head of the Department, the breakup of teacher's evaluation. The HoD shall ensure submission of all the records of test / examinations as prescribed under the course structure of the respective programs of that semester, to the Controller of Examination; (iii) Once the results are collated, at the end of semester, Controller of Examination shall call a meeting of Result Moderation Committee, if required. The Result Moderation Committee shall comprise:  Dean Academics: Chairperson  All Deans of the University: Members  Head of the Concerned Department: Member  Controller of Examinations: Member Secretary (iv) The final results of a semester shall be declared by the Controller of Examinations normally within 10 days of the last examination held. (v) The Grade Card containing the Semester Grade Point Average (SGPA), number of credits earned and Cumulative Grade Point Average (CGPA) obtained by a student till that semester shall be issued by the Controller of Examinations, at the end of each semester, after the declaration of the result. (vi) For Masters Program, result preparation and declaration shall be done in each semester and results to be declared after submission of the thesis and its successful passing of the viva voce examination. 6. USE OF UNFAIR MEANS: If a student is found guilty of using or attempting to use or having used unfair means at an examination, all such cases shall be placed before the duly constituted Committee for prevention of unfair means and the actions shall be taken as per procedure prescribed in the Regulation. 7. EXAMINATION GRIEVANCE COMMITTEE: 6 In case of any written representation / complaint received within seven days after completion of the examination regarding grievance pertaining to setting up of question paper or any other grievance"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-7",
    "content": "relating to examination. A student within 7 days may also represent regarding the grievance/complaint regarding evaluation. All such grievances/complaints shall be placed before the Examination Grievance Committee constituted by the University, which shall comprise the following: 1. Dean Academics - (Chairperson) 2. Concerned Head of the Department - (Member). 3. Outside Subject expert nominated by the Vice Chancellor - (Member). 4. Registrar - (Member) 5. Controller of Examination - (Convener/Secretary) The Vice Chancellor shall take appropriate decision on the recommendations of the Examination Grievance Committee, before the declaration of result(s) of the said examination. 8. UNIVERSITY EXAMINATION COMMITTEE The University Examination Committee shall be responsible to frame policy for overseeing the smooth and credible examination system of the University. The role of such committee shall include cancellation of the examination of a student and/or debars him/her from appearing in an examination of the University for specified term. The committee constituted by the Vice Chancellor shall consist of the following: (a) Nominee of the Vice Chancellor (b) One of the Dean's / Director nominated by the Vice Chancellor (c) Three Head of the Department by rotation. (d) Proctor of the University (e) Controller of Examination - Member Secretary The tenure of the Examination Committee shall be two years. Two third members will form the quorum of the meeting. There will be at least one meeting of the Examination Committee in each semester. The decisions of the Examination Committee shall be placed before the Vice Chancellor. Functions of the Examination Committee shall be: a. To frame detailed guidelines and procedures for an efficient, transparent and fair evaluation of students performance and conduct of examinations as well as for tabulators / programmers for preparing the results of the examinations. b. To supervise generally all the examinations of the University and issue such directions"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-8",
    "content": "as it may consider necessary for conduct of examinations. c. To review from time to time the results of the University examinations and submission of reports thereon to the Vice Chancellor. d. To make recommendations to the Vice Chancellor for the improvement of the examination system. 7 e. To consider the complaints received against Officers and Staff engaged for conduct of examinations; decision taken on these by appropriate committee and recommend to the Vice Chancellor about the action to be taken against the concerned person(s). f. To consider and recommend the rates of remuneration for the Examiners, Superintendents of Examination Centre and other staff engaged on examination duty, Tabulators and Collators etc associated with the examination duty. To investigate the cases of understandable divergence in the results of any Course Unit. For this purpose, the Examination Committee may itself scrutinize the answer books or may order their scrutiny by other person(s), and may also call an explanation from the examiner concerned for the divergence of marks beyond 10%. If after the investigation, the Committee is of the opinion that such divergence is due to leakage of paper, personal favoritism or animosity, it may recommend to the Vice Chancellor such action as it may deem fit, such as debar the examiner/evaluator from examinership permanently or for a specified period, a revaluation of the answer books etc 9. MODERATION COMMITTEE FOR QUESTION PAPERS (1) There may be a Moderation Committee for question papers comprising of the following members for one or more courses: (a) Head of Department- Chairperson (b) Senior faculty member having experience of teaching the course: Member (c) Controller of Examinations: Member Secretary Provided further that the Heads of Institutes may co-opt other experts not exceeding two, if required. Functions of the Moderation Committee shall be: (a) To ensure that"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-9",
    "content": "question papers are strictly in accordance with the course contents; (b) To remove ambiguity in the language of questions, if any; (c) To moderate / reframe the questions for higher learning levels so as to give opportunities to students of varying abilities; (d) To ensure proper coverage of course contents and indicate weightage / marks for each question or part / parts thereof, time prescribed and to correct errors, if any. (e) To ensure Questions at appropriate Blooms level of Taxonomy. (f) To see that questions relate to CO & PO. 10. LOSS OF ANSWER BOOK(S) (1) If any answer book of student(s) is lost at the Examination Centre after having been received by the Centre Superintendent of the examination or by any of the invigilators or during transmission to concerned person and if he passes in all other subjects of the examination, he may be required to re- appear in that particular paper in which the answer 8 book was lost, on a date fixed by the controller of examination or the student be given in missing paper, the average of marks earned by him in other papers. (2) In case of loss of Project Report/Summer Placement Report/ Dissertation of a student, the student will be required to submit duplicate copy thereof (3) In case of a dispute whether answer book(s) of students was/were duly received or not, the matter shall be handled by the University Examination Committee. 11. OFFICIAL TRANSCRIPTS TO STUDENTS The University will issue Official Transcript to a student for seeking admission in foreign universities / institutions for pursuing higher courses. All such documents shall be issued after deposition of prescribed fee as per the guidelines prescribed from time to time. 12. OPEN HOUSE The Examination Department shall facilitate review of the answer scripts to all"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-10",
    "content": "the students before finalization of results with aim to minimize the error in evaluation. The guidelines for open house shall be as under: (a) Evaluated answer scripts shall be shown to the students as per the schedule notified by the COE and ensure safety of the answer sheets. (b) The interested students shall be provided their answer scripts under the instruction and supervision of the Head of the Department. It will be the responsibility of the HoD to ensure that no answer scripts issued to the students is lost or misplaced in the process and they are returned back to examination branch in the same condition. (c) Students allowed for open house evaluation shall fill and submit duly signed form prescribed for the purpose by the Examination Department. (d) The Student shall be allowed to check only his / her own answer scripts and report any discrepancy relating to totaling of marks and unmarked question. No student shall be allowed to use mobile any digital device inside the hall specified for the purpose. (e) It shall be the responsibility of the student to be present in the open house at the specified time, date and place. If a student fails to report as per the schedule as notified by the COE, no other opportunity shall be provided to him. NOTE: If a student takes an academic break, he / she has the option of repeating any or all of the courses in the subsequent semester(s) and retain the credits already earned by him. 13. WAIVER Provided that under exceptional cases the Vice Chancellor may relax any clause of these regulations, if difficulties arise in its implementation, if such notifications, amendment, insertion, deletion which in his/her opinion are necessary or expedient for smooth running of the program. However, all such changes"
  },
  {
    "title": "Unknown",
    "start_page": 1,
    "chunk_id": "unknown-11",
    "content": "have to be reported to the Academic Council in the next meeting. 1585(i) MANAV RACHNA UNIVERSITY FARIDABAD MRU (ACADEMIC PROGRAMS) REGULATION, 2022 Approved by the Board of Management in its 20th Meeting held on 17.12.2022 INDEX Chapter No. Particular Page No. 1 BACHELOR OF TECHNOLOGY 01 - 09 2 MASTER OF TECHNOLOGY 10 - 18 3 MASTER OF SCIENCE 19 - 26 4 INTEGRATED B.A./B.Sc. BACHELOR OF EDUCATION 27 - 32 5 BACHELOR OF EDUCATION 33 - 39 6 INTEGRATED B.A. /B.B.A LAW (H) 40 - 46 7 BACHELOR OF BUSINESS ADMINISTRATION 47 - 52 8 B. ED. SPECIAL EDUCATION (LEARNING DISABILITY) 53 - 59 9 MASTER OF BUSINESS ADMINISTRATION 60 - 68"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-1",
    "content": "1 | P a g e MANAV RACHNA UNIVERSITY (ACADEMIC PROGRAMS) REGULATION, 2022 In pursuance of the provisions under Section 34 of the Haryana Private Universities Act, 2006, the Board of Management of the Manav Rachna University hereby makes the following Regulations relating to award of Degree in various disciplines of UG & PG Program. 1. Short Title and Application (i) These Regulations may be called MRU (Academic Programs) Regulation, 2022 (ii) These shall come in force from the date of approval of the Board of Management (iii) These shall apply to all the Programs prescribed in the regulations. 2. Definition (1) In these Regulations, unless the context otherwise requires; (i) \"Academic Bank Account\" means an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by an awarding institution; (ii) \"Academic Bank of Credits\" means an academic service mechanism as a digital or virtual or online entity established by the University Grant Commission with the approval of the Central Government, to facilitate students to become its academic account holders, thereby paving the way for seamless student mobility between or within degree-granting Higher Educational Institutions through a formal system of credit recognition, credit accumulation, credit transfers and credit redemption to promote distributed multi disciplinary and flexible teaching-learning; (iii) \"Chapter\" means chapter prescribed in the academic regulations; (iv) \"Course\" means one of the specified subjects which go to comprise a specified programme of study; (v) \"Credit\" means the standard methodology of calculating one hour of theory or one hour of tutorial or two hours of laboratory work, per week for a duration of a semester (13-15"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-2",
    "content": "weeks) resulting in the award of one credit; which is awarded by the University on which these regulations apply; and, Credits' for internship shall be one credit per one week of internship, subject to a maximum of six credits. However, for full Semester Internship, the University will device the mechanism for mapping credits. (vi) \"Credit-accumulation\" means the facility created by Academic Bank of Credits in the Academic Bank Account opened by students in order to transfer and consolidate the credits earned by them by undergoing Courses; (vii) \"Credits-recognition\" means the credits earned through a registered Higher Educational Institution and transferred directly to the Academic Bank of Credits by such Higher Educational Institution; (viii) \"Credit-redemption\" means the process of commuting the accrued credits in the Academic Bank Account of the students maintained in ABC for the purpose of fulfilling the credits 2 | P a g e requirements for the award of Degrees or Diplomas or Certificates or Course work for Ph.D. programme etc., by the registered degree-awarding Higher Educational Institutions; (ix) \"Credit-transfer\" means the mechanism by which the Registered Higher Educational Institutions are able to receive or provide prescribed credits to individual Academic Bank Accounts in adherence to the University Grants Commission credit norms for the 'course/s' undertaken by students enrolled in any Registered Higher Education Institution within India; (2) Words and expressions used and not defined in these Regulations but defined in Act, Statute or Ordinance and not consistent with these Regulations shall have the meanings assigned to them in that Act, Statute or Ordinance. 3 | P a g e CHAPTER 1: FOR BACHELOR OF TECHNOLOGY (B.TECH.) PROGRAMS, 1. Eligibility: (i) Candidates should have passed 10+2 Examination from a recognized Board / University, with minimum marks in aggregate as prescribed by the Academic Council from time to time,"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-3",
    "content": "keeping in view the norms of regulatory bodies. The candidate should have passed with Physics, Mathematics and English; or other combination of subjects, as required for specific B Tech Program, to be specified by the Academic Council of the University/AICTE. (ii) A candidate may be directly admitted to the Second year (third semester) of the Program through Lateral Entry on the basis of merit/rank in the test conducted by the University for the Seats as notified, which will be over and above the sanctioned intake (Supernumerary) of the approved intake in addition to vacant seats of the first year provided (a) The candidate has passed the 3 year diploma course from a recognized Board with minimum marks in aggregate as prescribed by the Academic Council from time to time, keeping in view the norms of regulatory bodies. OR (b) The candidate has passed B.Sc. course with Physics and Mathematics as subjects, from a recognized university with minimum marks in aggregate as prescribed by the Academic Council from time to time. 2. Merit Criterion for Admission: Admission to the B Tech program shall be made on the basis of merit in a national level entrance examination notified by the University or on the basis of an entrance examination conducted by the University. Such admissions shall be completed by a due date notified by the University. 3. Admission: (i) All admissions to the B. Tech. program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time. (ii) Admission and enrolment of students in the Manav Rachna University shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-4",
    "content": "University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs. (c) The candidates seeking admission to a program of study must fulfill the eligibility criteria in terms of educational qualification, age or any other condition as may be prescribed for it. 4 | P a g e (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to a particular program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 4. Migration from other Universities"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-5",
    "content": "/ Migration to other University: Such cases shall be governed as per the provisions in the ordinance. 5. ADMISSION OF THE CANDIDATES WHO HAVE GAP YEARS AFTER PASSING ELIGIBILITY QUALIFICATION: Such cases shall be governed as per the provisions in the ordinance. The cases relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCrF), guidelines & other similar policies notified from time to time. 6. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 7. Program Structure (i) Program Duration: (a) The B. Tech. program is a Full-Time Under Graduate Program of four years' duration. The maximum time span in which a candidate must qualify the degree shall be seven academic years, failing which he/she shall not be allowed to continue his/her studies for the program In the University. (b) The program offered shall be normally semester based and comprise eight semesters. Each semester shall normally be of about 13-15 weeks duration. The University may, in addition, 5 | P a g e introduce mandatory Trainings / Workshops / Courses for the students. The academic departments may assign additional value-added Course/work as well. (c) For a program, the academic year shall normally comprise odd semester (Aug. to Dec), even semester (Jan. to May) and a summer training period (normally in the months of May, June & July). (d) The starting and ending dates of the semesters and the training schedules"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-6",
    "content": "shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Courses of Study: The programme may be offered in hybrid mode, face to face or online mode, as decided by the University. The program of study shall consist of the Core and Professional & Open Elective Courses offered. These courses could be offered in combination of various L-T-P modes. Lecture: Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a large class. Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Practical Lab: Module of the course aimed at doing practical work using different instruments, equipments, systems or software's etc. to enhance skill component. The program of study shall consist of: (a) Core Courses (≅ 60%): Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted; (b) Elective Courses (≅ 20%): Group of courses in a program where the student has the flexibility of choosing courses of his choice and interest. (c) Non-Teaching Credit Courses (≅ 20%): These courses involve no teaching and includes seminars, presentations, dissertations, projects, thesis etc.; (d) Special / Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses/ Value added Courses: for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills. (e) Training Modules: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-7",
    "content": "and shall stress upon 'learning by doing'. Modules can be organized during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This training could be organized in an industry / research organization or other institutions, as well.. (f) Bridge Courses: Courses introduced to enhance the basic knowledge and skills of the students prior to undertaking advance courses of the Program. These courses will not carry any credit and will not be counted for SGPA or CGPA calculations; 6 | P a g e (g) Mandatory Course: Any additional Compulsory courses prescribed by the Department / University, which may or may not be an audit course. (h) Any other course: The department may prescribe any course that in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (iii) Program Credit Requirement: The University shall follow the choice-based credit system. The total credit requirement for the award of the B. Tech. degree shall be around 160. A student will be eligible for degree with Honours if he/she completes an additional 20 credits in a particular domain (in the program of study) or may earn Minor degree in case acquires additional 20 credit in other domain (in any other program of study). A student can earn a maximum of 40% of the total credits through MOOCs. The credit earned by the students through online / contact mode from any national / international institutions with prior approval of the University shall be counted in his /her credits earned, as per the weightage recommended by the Committee (The mapping Committee) constituted by the University for the purpose. (iv) Lower and Upper Limits"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-8",
    "content": "for Credits Registered: A student has flexibility in terms of registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be able to take up the academic rigor may register for less credit of a minimum of 15 credits to maintain his / her continuity in the program.. Student has also choice to register for a maximum of 30 Credit in a semester, if he / she wishes to complete the program either at faster pace, provided has a CGPA of more than 8.0 or needs to register for previous semester courses due to detention. 8. Attendance: A student shall be required to fulfill the attendance criteria as prescribed in the Ordinance. 9. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as per the guidelines prescribed in the MRU (Examination) Regulations or as amended from time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and fails to deposit the prescribed fee within stipulated date. (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. It shall be the responsibility of concerned head of the Department in consultation with Board of 7 | P a g e Study to finalize"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-9",
    "content": "the scheme of evaluation for particular courses and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. Students should register for courses on NPTEL/MOOCS/other online platforms before the commencement of the course and these courses shall be duly approved by the department, at the time of registration of the semester. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. The assessment for practical courses shall be done through one End Term Practical Examination (PT). Summer training shall culminate in submission of project report and its evaluation by departmental committee. Student may also earn credits through innovation, internship, MOOCs etc. and shall be credited to the students account after proper assessment. (iii) Assessment Parameters and its"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-10",
    "content": "rubrics for introducing project based learning Departments may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper knowledge through active exploration of real-world challenges and problems. For course offered under Project based learning mode, classroom deliveries to cover the fundamental concepts. The students would be required to work on a project in a team comprising of 3-4 members. These projects would be based on the fundamental principles of the respective subject that is /are offered in PBL mode and should be preferably on the current societal needs. 8 | P a g e While working on the project students are expected to apply the knowledge of all the subjects they have studied or studying during that semester and provide innovative solutions to the problems undertaken. To illustrate, the courses being offered in PBL Mode shall be evaluated through detailed rubrics at each of the following stages, as mentioned below in five stages as mentioned below: Stage Weightage During week of -Commencement of Session Ideation 10% 3rd - 4th week Analysis 15% 5th - 6th week Design 20% 8th - 9th week Development 25% 11th -12th week Testing & Integration 30% 13th- 15th week Assessment shall be made at various different stages by using detailed rubrics as approved by the department & communicated to students in advance. Assessment may be done by using one or more of the following methods: Query, Tests, MCQs, Group Discussion, Assignment or any other parameter which BOS deems fit before starting the project. The final assessment should be measured by mapping the attainment with respect to objectives as set at the start of the project. 10. Preparation and Declaration"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-11",
    "content": "of Results: All norms for preparation and declaration of results prescribed in the MRU (Examination) Regulation, 2022 or as amended from time to time, shall be followed. 11. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the regulation on prevention of unfair means in the examination. 12. Examination Grievance Committees: Committee shall be constituted as per provisions in the regulation for conduct of examination. 13. Graduation Requirements: (i) Minimum Credits: The total credit requirement for the award of the B. Tech. degree shall be around 160. Candidate shall have to earn the minimum credits as per the Program Structure, to be eligible for the award of degree. These credits should be earned under different categories as follows: A student shall register and earn credits for: (a) All core courses as defined in curriculum scheme; (b) All trainings; (c) At least one elective course from other disciplines of Engineering/Sciences; (d) At least one elective course from the discipline of Management/Education/Humanities/Law etc. (e) At least two courses through online platform. Student shall also pass all mandatory courses, audit courses and shall fulfill any other requirement as prescribed by the Department from time to time. 9 | P a g e (ii) Credits Earned at Different Universities / Institutes: Credits earned by a student through course work / project work / internship at other Institutions / Industry / Organization in India or abroad shall be counted towards total credit earned by the student for award of degree. This shall be facilitated with the approval of the Dean Academics on the recommendations of the respective department. (iii) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-12",
    "content": "by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognized, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. 10 | P a g e CHAPTER: 2 MASTER OF TECHNOLOGY (M.TECH) PROGRAMS 1. Eligibility: Candidates having passed B. Tech./ B.E./ MCA/ Post Graduate Degree from a recognized University or equivalent, with minimum marks in aggregate as notified by the University shall be eligible to apply for admission to the M. Tech. program. These regulations are in line with the norms of statutory bodies. There shall be two kinds of M. Tech. programs: (a) Multi-disciplinary Program: This program shall have candidates admitted from diverse backgrounds (as specified by the eligibility of the program). (b) Specialized Degree Program: The program"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-13",
    "content": "is a specialized degree in the same field in which the graduation has been done by the candidate. Program Degree Eligibility Multi-disciplinary Program: M.Tech For M.Tech. in a multi disciplinary program, the candidates must possess sufficient background to be able to cope up with the course structure of such programs. For example, M.Tech in Information Technology (IT), the candidates must have a Degree in any Branch of Engineering / MCA / PG Degree (as specified in the Program) or equivalent are eligible for admission. Specialized Degree Program: M.Tech in Computer Engineering Candidates with B.E. / B. Tech. in Computer Science & Engineering / Computer Engineering / Information Technology /Robotics & Artificial intelligence/ MCA or equivalent are eligible for admission. M.Tech in Electronics &Communicat ion Engineering Candidates with B.E / B.Tech in Electronics & Instrumentation/ Electronics Engineering / Electronics Instrumentation & Control / Instrumentation & Control/ Electrical Instrumentation & Control/ Instrumentation Engineering/ Control Engineering/ Electronics Engineering /Computer Science & Engineering or equivalent/ M.Sc. Physics/ M.Sc. Electronics are eligible for admission. M.Tech in Mechanical Engineering Candidates with B.E / B.Tech in Mechanical Engineering/ Production Engineering/ Automobile Engineering/ Industrial Engineering/ Agriculture Engineering/ Aeronautical Engineering/ Marine Engineering/ Mining and Metallurgy//Robotics & Artificial intelligence/ or equivalent are eligible for admission. 11 | P a g e 2. Merit Criterion: Admission to the M.Tech Program shall be made on the basis of merit in a national level Entrance Exam (GATE) or on the basis of Entrance Exam conducted by the University. Such admissions shall be made by a due date fixed by the University. 3. Admission: (i) All admissions to the M. Tech. Program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time.. (ii) Admission and"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-14",
    "content": "enrolment of students in the program shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs. (c) The candidates seeking admission to a program of study must fulfill the eligibility criteria in terms of educational qualification, age or any other conditions as may be prescribed for it. (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to a particular program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-15",
    "content": "student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 12 | P a g e 4. Admission of the Candidates who have Gap Years after passing eligibility qualification: Such cases shall be governed as per the provisions in the ordinance. The cases relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCrF), guidelines & other similar policies notified from time to time. 5. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 6. Program Structure (i) Program Duration: (a) The University offer M.Tech program in Full Time and Part Time mode. The duration of Full Time program shall be two years and that of Part Time program shall be three years. The maximum time span in which a candidate must qualify for the degree shall be four academic years for Full Time program and five academic years for Part Time program failing which he/she shall not be allowed to continue his/her studies for the program. There is provision for lateral exit with a Post Graduate Diploma as given later in this regulation. (b) Program offered shall be semester based and comprise four semesters for full time program and six semesters for part time program. Each semester shall normally be of 13-15 weeks duration. The University may, in addition, introduce mandatory Trainings / Workshops / Courses for the students."
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-16",
    "content": "The academic departments may assign additional value-added Course/work as well. (c) For a program, the academic year shall normally comprise odd semester (Aug - Dec.), even semester (Jan - May) and a summer training period (normally in the months of May, June & July). (d) The starting and ending dates of the semesters and the training schedules shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Courses of Study: The programme may be offered in hybrid mode, face to face or online mode as decided by the University. The program of study shall consist of the Core and Professional & Open Elective Courses offered. These courses could be offered in combination of various L-T-P modes. Lecture: Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a large class. Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Practical Lab: Module of the course aimed at doing practical work using different instruments, equipments, systems or software's etc. to enhance skill component. 13 | P a g e The program of study shall consist of: (a) Core Courses (≅ 60%):: Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted. (b) Elective courses (≅ 20%):: Group of courses in a program where the student has the flexibility of choosing courses, of his choice and interest. (c) Non-Teaching Credit Courses (≅ 20%):: These courses involve no teaching and include seminars, presentations, dissertations, projects, thesis etc. (d) Workshop Courses having only P component: These are completely 'hands on' courses based on new or emerging technologies; (e) Special"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-17",
    "content": "/ Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses/ Value added Courses: for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills. (f) Training Modules: Objective of summer training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be concentrated during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This training could be organized in an industry / research organization or other institutions, as well. (g) Mandatory Course: Any additional Compulsory courses prescribed by the Department / University, which may or may not be an audit courses. (h) Any other course: The department may prescribe any course which in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (i) Dissertation: The Objective of dissertation is to allow Post Graduate students to experience and learn the methodologies of carrying out research work in a domain which may be interdisciplinary in nature. (iii) Program Credit Requirement: The total credit requirement for the award of the M. Tech. Degree shall be around 72 credits depending upon the specified curriculum & scheme of examination of the specific M. Tech. program. These credits shall be earned under different categories as specified by the curriculum scheme of the specific M. Tech. Branch. (iv) Lower and Upper Limits for Credits Registered: A student has flexibility in terms of registering"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-18",
    "content": "the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be able to take up the academic rigor may register for less credit eg. a minimum of 14 | P a g e 12 credits in case of full time program and 8 credits in case of part time program to maintain his / her continuity in the program. Student has also choice to register for a maximum of 24 Credit in a semester in case of full time program and 16 Credits in part time program, if he / she wishes to complete the program either at faster pace, provided has a CGPA of more than 8.0 or needs to register for previous semester courses due to detention. 7. Attendance: A student shall be required to fulfill the attendance criteria as prescribed in the Ordinance. 8. Conduct of Examination & Evaluation: (i) Conduct of Examination (a) The University shall conduct examinations as the guidelines prescribed in the MRU (Examination) Regulations or as amended time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and deposit the prescribed fee within stipulated date. (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. It shall be the responsibility of"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-19",
    "content": "concerned head of the Department in consultation with Board of Study to finalize the scheme of evaluation for particular courses and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. Students may be asked to register for courses on NPTEL/MOOCS/other online platforms duly approved by the University. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by 15 | P a g e concerned faculty to the students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. The assessment for practical courses shall be done through one End Term Practical Examination (PT). In case a student is pursuing his /her dissertation work in industry or in a research organization he/she shall have to present the progress of the work after respective semester for its evaluation before a board constituted by"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-20",
    "content": "the Department. Departments may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper knowledge through active exploration of real-world challenges and problems. (iii) Examination and Evaluation of Dissertation Preparatory Project Course and Dissertation: (a) Dissertation Preparatory Project Course: The Dissertation Preparatory Project shall be oriented towards carrying out literature survey, familiarizing with tools and techniques and in general, building the background for the dissertation works. It shall culminate in the formulation of a Dissertation Plan and should be presented within 10-12 weeks from completion of Second Semester (course work). For students working on their Dissertation work in the University, the assessment shall normally be carried out in three stages during the course of project work. Table 2.1 Stage 1: approx 5 weeks into the semester 20% Stage 2: approx 10 weeks into the semester 20% Stage 3: at the end of the semester 60% It shall be the responsibility of the supervisor to ensure that candidate should finalize the dissertation plan in consultation with him/her. (b) Dissertation: The dissertation work will be carried out during Third & Fourth semester of full time program and Fifth & Sixth semester of part time program and will by and large adhere to the dissertation plan submitted before the start of dissertation work. The evaluation stages for dissertation shall be as given in the Table 2.2. 16 | P a g e Table 2.2 Evaluation Stage Time Line Weightage Conditions Stage 1: Approx 5 weeks into the semester 20% Student failing to secure at least 20% marks allocated to dissertation work, shall not be allowed to proceed to the pre-dissertation seminar Stage 2: Approx 10 weeks into"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-21",
    "content": "the semester 20% Pre- Dissertation Seminar: Approx 14 weeks into the semester - All candidates shall be required to clear a pre dissertation seminar to be eligible for the Stage 3 Evaluation. Stage 3: At the end of the semester 60% Evaluation shall have two equal components: External Evaluation by examiner from outside the University Viva Examination by a committee set up by the department (c) Submission of Dissertation: The student shall submit an electronic copy of the Dissertation in the prescribed format to the Department, as per schedule. Upon receiving of satisfactory report from the external examiner the student shall submit three soft bound copies of the dissertation to the department. (d) Dissertation Evaluation: (i) APPOINTMENT OF THESIS SUPERVISOR(S) AND CONSTITUTION OF THESIS EXAMINATION BOARD (a) Appointment of Thesis Supervisor(s) (i) It shall be the responsibility of the Department to allocate Thesis Supervisor to all the registered students. A Student shall be allotted Thesis Supervisor preferably during the second semester. (ii) A student shall not normally have more than two supervisors at any given time. (iii) Thesis supervisor(s) of a student shall be appointed amongst the Faculty Members of the University in the manner prescribed by the department and approved by Dean, Academics. Normally, a Faculty Member shall not supervise more than five students of masters program. However the Department may evolve a transparent policy for the distribution of students amongst the Faculty Members in the Department. (iv) A student on the recommendation of the HoD can have a co-supervisor from outside the University. (v) In case, there has been a change / addition in the supervisor(s) such changes shall not be permitted within the last three month of program duration. (vi) If a student's supervisor proceeds on long leave (more than 3 months) and if there is only"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-22",
    "content": "one supervisor, then prior to proceeding on such a leave, HOD in consultation with Dean of Faculty and the student, shall appoint a thesis coordinator to ensure 17 | P a g e that the student's work does not suffer in his/her absence. Further, if all research work and related analysis is complete except writing of the thesis and the supervisor proposes to go on leave, the Thesis coordinator / HOD shall take care of the formalities. (vii) In case a supervisor resigns / retires or otherwise ceases to be a Faculty Member of the University, the HOD shall appoint a new supervisor or co-supervisor in consultation with the student. (viii) In case a Faculty Member is suspended / debarred by the University for indulging in lowering the prestige of the University in any manner, he/she shall cease to be a thesis supervisor. (b) Constitution of Thesis Examination Board The Examination Board for evaluation of the thesis shall consist of (i) One Faculty from the University / Outside University form the same area (ii) One Faculty from the Department having expertise in the area of thesis. (iii) Thesis Supervisor(s): Thesis supervisor shall recommend the names of the examination board to the Dean Academics for its approval. The Board shall give its recommendation for accepting or rejection of the thesis and the same shall be sent to the office of Controller of Examination. (ii) THESIS SUBMISSION AND EXAMINATION (a) After the Examination Board is constituted, unbound copies of the thesis report one for each examiner of the Examination Board shall be prepared according to the format prescribed. (b) All the work carried out as part of the dissertation shall be screened using the software for plagiarism and in case the report shown is more than permissible limit, the dissertation report has"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-23",
    "content": "to be resubmitted. A certificate that no part of the Thesis is plagiarized has to be submitted by the student. (c) Thesis shall be submitted at least a week before the probable date of Oral Examination. The HOD shall arrange to send the soft copies of the thesis to the examiners appointed by the Dean Academics. The examiner shall evaluate and grade the dissertation for presentation, organization and content and send the report to the office of Controller of Examinations. After the final Viva Voce, the modifications suggested if any by the Examination Board, may be incorporated in the thesis and three copies of the thesis be submitted to the Examination Section. 9. Preparation and Declaration of Results All norms for preparation and declaration of results prescribed in the MRU (Conduct of Examination) Regulation, 2020 shall be followed. 10. Use of Unfair Means All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the ordinance / regulation on prevention of unfair means in the examination. 18 | P a g e 11. Examination Grievance Committees: Committee shall be constituted as per provisions in the regulation for conduct of examination. 12. Graduation Requirements As specified in the curriculum scheme, completion of minimum number of credits, including all prescribed courses and successful completion of all stages of dissertation work shall be the condition for becoming eligible for the award of degree. In addition, a student shall have to fulfill all other conditions as prescribed by the Department / University from time to time. 13. Credits Earned at Different Universities / Institutes Provision shall be made for acknowledgement of credits earned by a student through course work / project work / internship at other institutions in India or abroad. This shall be facilitated with"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-24",
    "content": "the approval of Vice-Chancellor on the recommendation of the respective Dean. 14. Lateral Exit: A candidate may be allowed to exit from the full time program, with a Post Graduate Diploma, provided that the candidate completes at least one academic year of program, completes all trainings, if any, and earns a minimum of 40 credits including all prescribed courses offered. A candidate opting to exit after one year shall be awarded Post Graduate Diploma. If a candidate is interested in completing the M. Tech. after completion of the maximum duration of the program, he/she shall have to register as a fresh candidate. 15. Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-25",
    "content": "preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. 19 | P a g e CHAPTER: 3 - MASTER OF SCIENCES (M.SC.) 1. Eligibility: (i) Candidates with three years/ 6 Semester Bachelor Degree Program (B.Sc. (Hons.) or four Years / 8 - Semester (B.Sc. Hons. with Research) degree program or equivalent with minimum marks in aggregate as notified by the University in view the norms of statutory bodies, in relevant disciplines as indicated below shall be eligible to apply for admission to the M.Sc. Program. M. Sc. in Chemistry: Candidates with three years/ 6 Semester Bachelor Degree Program (B.Sc. (Hons.) Chemistry) or & B Sc. (General) with PCM / Biology having Chemistry in last semester or four Years / 8 Semester (B.Sc. Hons. with Research) degree program or equivalent are eligible for admission. M. Sc. in Physics: Candidates with three years/ 6 Semester Bachelor Degree Program (B.Sc. (Hons.) Physics) or four Years / 8 Semester (B.Sc. Hons. with Research) degree program or equivalents are eligible for admission. M. Sc. in Mathematics: Candidates with three years/ 6 Semester Bachelor Degree Program (B.Sc. (Hons.) Mathematics) or B.Sc. (General) with PCM (having Mathematics in last year or last 2 semesters or four Years / 8 Semester (B.Sc. Hons. with Research) degree program or equivalent are eligible for admission. 2. Merit Criterion for Admission: Admission to the M.Sc. Program shall be made on the basis of marks or grades obtained in qualifying examination and achievements in co-curricular and extra-curricular activities or on the basis of marks / grade obtained in the entrance test conducted by the University. Such admissions shall be made as per admission schedule notified by the university. 3. Admission: (i) All admissions to the M.Sc."
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-26",
    "content": "program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time. (ii) Admission and enrolment of students in the program shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs.. 20 | P a g e (c) The candidates seeking admission to a program of study in the University must fulfill the eligibility criteria in terms of educational qualification, age restrictions or any other condition as may be prescribed for it. (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to a particular program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-27",
    "content": "proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 4. ADMISSION OF THE CANDIDATES WHO HAVE GAP YEARS AFTER PASSING ELIGIBILITY QUALIFICATION: Such cases shall be governed as per the provisions in the ordinance. The cases relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCF), guidelines & other similar policies notified from time to time. 5. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 6. Program Structure: (i) Program Duration: (a) The University shall offer M.Sc. program in full time mode only. The duration of full time program shall be One Year for those having completed four year / 8 semester graduation Degree with research and Two years for those having completed graduation degree with three years /six semester duration. The maximum time span in which a candidate must qualify for the degree shall be Two / Four academic years respectively failing which he/she shall not be allowed to continue his/her studies for the program. 21 | P a g e (b) The program offered shall be semester based and comprise two /"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-28",
    "content": "four semesters. Each semester shall normally be of 13-15 weeks duration. The University may, in addition, introduce mandatory Trainings / Workshops / Courses for the students. The academic departments may assign additional value-added Course/work as well. (c) For a program the academic year shall normally comprise odd semester (Aug - Dec), even semester (Jan - May) and a summer training period (normally in the months of May, June & July). (d) The starting and ending dates of the semesters and the training schedules shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Courses of Study: The programme may be offered in hybrid mode, face-to-face or online mode as decided by the University. The program of study shall consist of the Core and Professional & Open Elective Courses offered. These courses could be offered in combination of various L-T-P modes. The various courses shall comprise one or more of following components: Lecture (L): Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a class. Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Practical (P) Lab: Module of the course aimed at doing practical work using different instruments, equipments, , systems or software's etc. to enhance skill component. The program of study shall consist of: (a) Core Courses(≅ 60%): Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted; (b) Elective Courses: Group of courses in a program where the student has the flexibility of choosing courses of his choice and interest. (c) Non-Teaching Credit Courses: These courses involve no teaching and includes seminars,"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-29",
    "content": "presentations, dissertations, projects, thesis etc.; (d) Special / Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses / Value added Courses: for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills. (e) Training Modules: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be organized during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This training could be organized in an industry / research organization or other institutions, as well. 22 | P a g e (f) Mandatory Course: Any additional Compulsory courses prescribed by the University, which may or may not be an audit courses (g) Any other course: The department may prescribe any course which in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (h) Dissertation: The Objective of dissertation is to allow Post Graduate students to experience and learn the methodologies of carrying out research work in a domain which may be interdisciplinary in nature. (iii) Programme Credit requirement: University shall follow the choice based credit system. The total credit requirement for the award of the M. Sc Degree shall range between 75 and 85 credits depending upon the specified curriculum & scheme of examination of the specific M. Sc program. (iv) Lower and Upper Limits for Credits Registered: A student has flexibility in terms of"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-30",
    "content": "registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be able to take up the academic rigor may register for less credit eg. a minimum of 12 credits to maintain his / her continuity in the program.. Student has also choice to register for a maximum of 30 Credit in a semester, if he / she wishes to complete the program either at faster pace, provided has a CGPA of more than 8.0 or needs to register for previous semester courses due to detention. 7. Attendance: A student shall be required to fulfill the attendance criteria as prescribed in the Ordinance. 8. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as the guidelines prescribed in the MRU (Examination) Regulation or as amended from time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and deposit the prescribed fee within stipulated time. (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. Departments may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-31",
    "content": "knowledge through active exploration of real-world challenges and problems. 23 | P a g e It shall be the responsibility of concerned head of the Department in consultation with Board of Study to finalize the scheme of evaluation for particular courses and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. The assessment for practical courses shall be done through one End Term Practical Examination (PT). Students should register for courses on NPTEL/MOOCS/other online platforms before the commencement of the course and these courses shall be duly approved by the department, at the time of registration of the semester. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. Summer training shall culminate in submission of"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-32",
    "content": "project report and its evaluation by departmental committee. (iii) Examination and Evaluation of Dissertation/ Project Work: (a) Dissertation/Project: The dissertation/project work will be carried out during fourth semester. The evaluation stages for dissertation/project work shall be as given in the Table 4.1. Table 4.1 Evaluation Stage Time Line Weightage Conditions Stage 1: Approx 5 weeks into the semester 20% Student failing to secure at least 20% marks allocated to dissertation/project work, shall not be allowed to proceed to Stage 2: Approx 10 weeks into 20% 24 | P a g e the semester the End semester evaluation Stage 3: At the end of the semester 60% Evaluation shall have two equal components: 1. Project presentation 2. Viva Examination (by Committee set up by the department having at least one examiner from outside the University) (b) Submission of Dissertation: The student shall submit an electronic copy of the Dissertation in the prescribed format to the Department, as per schedule. Upon receiving of satisfactory report from the external examiner the student shall submit three soft bound copies of the dissertation to the department. (c) Dissertation Evaluation: (i) APPOINTMENT OF THESIS SUPERVISOR(S) AND CONSTITUTION OF THESIS EXAMINATION BOARD (a) Appointment of Thesis Supervisor(s) (i) It shall be the responsibility of the Department to allocate Thesis Supervisor to all the registered students. A Student shall be allotted Thesis Supervisor preferably during the third semester. (ii) A student shall not normally have more than two supervisors at any given time. (iii) Thesis supervisor(s) of a student shall be appointed amongst the Faculty Members of the University in the manner prescribed by the department and approved by Dean, Academics. Normally, a Faculty Member shall not supervise more than five students of masters program. However the Department may evolve a transparent policy for the distribution of students"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-33",
    "content": "amongst the Faculty Members in the Department. (iv) A student on the recommendation of the HoD can have a co-supervisor from outside the University. (v) In case, there has been a change / addition in the supervisor(s) such changes shall not be permitted within the last three month of program duration. (vi) If a student's supervisor proceeds on long leave (more than 3 months) and if there is only one supervisor, then prior to proceeding on such a leave, HOD in consultation with Dean of Faculty and the student, shall appoint a thesis coordinator to ensure that the student's work does not suffer in his/her absence. Further, if all research work and related analysis is complete except writing of the thesis and the supervisor proposes to go on leave, the Thesis coordinator / HOD shall take care of the formalities. (vii) In case a supervisor resigns / retires or otherwise ceases to be a Faculty Member of the University, the HOD shall appoint a new supervisor or co-supervisor in consultation with the student. 25 | P a g e (viii) In case a Faculty Member is suspended / debarred by the University for indulging in lowering the prestige of the University in any manner, he/she shall cease to be a thesis supervisor. (b) Constitution of Thesis Examination Board The Examination Board for evaluation of the thesis shall consist of (i) One Faculty from the University / Outside University form the same area (ii) One Faculty from the Department having expertise in the area of thesis. (iii) Thesis Supervisor(s): Thesis supervisor shall recommend the names of the examination board to the Dean Academics for its approval. The Board shall give its recommendation for accepting or rejection of the thesis and the same shall be sent to the office of Controller of"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-34",
    "content": "Examination. (ii) THESIS SUBMISSION AND EXAMINATION (a) After the Examination Board is constituted, unbound copies of the thesis report one for each examiner of the Examination Board shall be prepared according to the format prescribed. (b) All the work carried out as part of the dissertation shall be screened using the software for plagiarism and in case the report shown is more than permissible limit, the dissertation report has to be resubmitted. A certificate that no part of the Thesis is plagiarized has to be submitted by the student. (c) Thesis shall be submitted at least a week before the probable date of Oral Examination. The HOD shall arrange to send the soft copies of the thesis to the examiners appointed by the Dean Academics. The examiner shall evaluate and grade the dissertation for presentation, organization and content and send the report to the office of Controller of Examinations. After the final Viva Voce, the modifications suggested if any by the Examination Board, may be incorporated in the thesis and three copies of the thesis be submitted to the Examination Section. 9. Preparation and Declaration of Results: All norms for preparation and declaration of results prescribed in the MRU (Conduct of Examination) Regulation, 2020 shall be followed. 10. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the ordinance / regulation on prevention of unfair means in the examination. 11. Examination Grievance Committees Committee shall be constituted as per provisions in the regulation for conduct of examination. 12. Graduation Requirements: (i) Minimum Credits: As specified in the curriculum scheme, completion of minimum number of credits, including all core courses, successful completion of summer training; and successful completion of all stages 26 | P a g e"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-35",
    "content": "of dissertation/project work shall be the condition for becoming eligible for the award of degree. In addition, a student shall have to fulfill all other conditions as prescribed by the University from time to time. (ii) Credits Earned at Different Universities / Institutes: Provision shall be made for acknowledgement of credits earned by a student through course work/project work/internship at other institutions in India or abroad. This shall be facilitated with the approval of Vice-Chancellor on the recommendation of the respective Dean. (iii) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-36",
    "content": "date as specified in the regulation. 27 | P a g e CHAPTER: 4 - B.A. / B.Sc. B.Ed. (Integrated) 1. Eligibility: Candidates should have passed 10+2 Examination from a recognized Board / University, with minimum marks in aggregate as prescribed by the Academic Council from time to time, keeping in view the norms of regulatory bodies. 2. Merit Criterion for Admission: Admission to the B.A / B.Sc. B.Ed. (Integrated) program shall be made on the basis of marks or grades obtained in the qualifying examination and achievements in co-curricular and extra- curricular activities or on the basis of marks / grade obtained in the entrance test conducted by the University. Such admissions shall be completed by a due date notified by the University. 3. Admission: (i) All admissions to the B.A / B.Sc. B.Ed. (Integrated) program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time (ii) Admission and enrolment of students in the program shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs. (c) The candidates seeking admission to a program of study must fulfill the eligibility criteria in terms of educational qualification, age or any other conditions as may be prescribed for it. (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-37",
    "content": "the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to a particular program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 28 | P a g e 4. Migration from other Universities / Migration to other University: Such cases shall be governed as per the provisions in the ordinance. 5. Admission of the Candidates who have Gap Years after passing Eligibility Qualification: Such cases shall be governed as per the provisions in the ordinance. The cases relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCrF), guidelines & other similar policies notified from time to time. 6. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-38",
    "content": "authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 7. Program Structure: (i) Program Duration: (a) The B.A./ B.Sc. B.Ed. (Integrated) program is a Full-Time undergraduate program of four years' duration. The maximum time span in which a candidate must qualify the degree shall be six academic years, failing which he/she shall not be allowed to continue his/her studies for the program. (b) The program offered shall be semester based and comprise eight semesters. Each semester shall normally be of 13-15 weeks duration. The University may, in addition, introduce mandatory Trainings / Workshops / Courses for the students. The academic departments may assign additional value-added Course/work. (c) During the program, the duration of internship will be 20 weeks, involving 4 weeks in third year and 16 weeks in the fourth year. (d) The starting and ending dates of the semesters and the training schedules shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Course of study: The programme may be offered in hybrid mode, face to face or online mode as decided by the University . The program of study shall consist of the Core and Professional & Open Elective Courses offered. These courses could be offered in combination of various L-T-P modes. Lecture: Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a large class. Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Practical Lab: Module of"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-39",
    "content": "the course aimed at doing practical work using different instruments, equipments, systems or software's etc. to enhance skill component. The program of study shall consist of: (a) Core Courses (≅ 60%): Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted. 29 | P a g e (b) Elective courses: Group of courses in a program where the student has the flexibility of choosing courses of his choice and interest. (c) Workshop courses: These are hand on courses conducted in field/organization /classroom aimed at developing practical skills / application orientation / implementation capabilities / design skills of the student. (d) Non-Teaching Credit Courses: These courses involve no teaching and includes seminars, presentations, dissertations, projects, thesis etc.; (e) Special / Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses/Value added Courses: for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills. (f) Training Modules: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be organized during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This training could be organized in an industry / research organization or other institutions, as well. (g) Bridge Courses: Courses introduced to enhance the basic knowledge and skills of the students prior to undertaking advance courses of the Program. These courses will not carry any credit and will not be counted for SGPA or CGPA calculations; (h) Mandatory"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-40",
    "content": "Course: Any additional Compulsory courses prescribed by the Department / University, which may or may not be an audit courses. (i) Audit Course: These Courses will not carry any credit and will not be counted for SGPA or CGPA calculation. (j) Any other course: The department may prescribe any course which in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (iii) Program Credit Requirement: University shall follow the choice based credit system. The total credit requirement for the award of the B.A. / B.Sc. B.Ed. (Integrated) degree shall range between 190 to 200 depending upon the specified curriculum and scheme of examination of B.A. / B.Sc B.Ed (Integrated) program. A student can earn a maximum of 40% of the total credits through MOOCs. The credit earned by the students through online / contact mode from any national / international institutions with prior approval of the University shall be counted in his /her credits earned, as per the weightage recommended by the Committee (The mapping Committee) constituted by the University for the purpose. (iv) Lower and Upper Limits for Credits Registered: A student has flexibility in terms of registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she 30 | P a g e would not be able to take up the full academic rigor, he/she may register for less credit of a minimum of 14 credits to maintain his / her continuity in the program.. Student has also choice to register for a maximum of 32 Credit in a semester, if he / she wishes to complete the program either at"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-41",
    "content": "faster pace, provided has a CGPA of more than 8.0 or needs to register for previous semester courses due to detention. 8. Attendance: A student of Education Program (UG/PG) shall be required to have a minimum attendance of 80% for all course work and practicum to be eligible for appearing in end semester examination. Also, he/she should have 90% minimum attendance for school internship as per guidelines prescribed by the Regulatory Bodies from time to time. 9. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as the guidelines prescribed in the MRU (Examination) Regulations or as amended from time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and fails to deposit the prescribed fee within stipulated date. (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. It shall be the responsibility of concerned head of the Department in consultation with Board of Study to finalize the scheme of evaluation for particular courses and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-42",
    "content": "faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on 31 | P a g e instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. The assessment for practical courses shall be done through one End Term Practical Examination (PT). Summer training shall culminate in submission of project report and its evaluation by the Departmental Committee. School Internship Program shall be evaluated with help of reflective journal by student teachers, observation by mentors, practical exams and files preparation etc. The mode of evaluation shall be announced at the beginning of the School Internship Program. Students should register for courses on NPTEL/MOOCS/other online platforms before the commencement of the course and these courses shall be duly approved by the department, at the time of registration of the semester. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. Student may also earn credits through innovation, internship, MOOCs etc. and shall be credited to the students account after proper assessment. 10. Preparation and Declaration of Results All norms for preparation and declaration of results prescribed in the MRU (Examination) Regulation,"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-43",
    "content": "2022 shall be followed. 11. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the ordinance / regulation on prevention of unfair means in the examination . 12. Examination Grievance Committees : Committee shall be constituted as per the provisions prescribed in the MRU (Examination) Regulation, 2022. 13. Graduation Requirements: (i) Minimum Credits: The total credit requirement for the award of Integrated B.Ed. degree shall range between 190 to 200. These credits should be earned under different categories as follows: A student shall register and earn credits for: (a). All core courses as defined in curriculum scheme (b). School internship (c). Summer trainings as specified in the Program Structure. (d). At least two elective courses offered by parent department; (e). At least one elective course offered by allied departments. (f). At least one course through online platform Student shall also pass all University mandatory courses, audit courses and shall fulfill any other requirement as prescribed by the University from time to time. 32 | P a g e (ii) Credits Earned at Different Universities / Institutes: Credits earned by a student through course work / project work / internship at other Institutions / Industry / Organization in India or abroad shall be counted towards total credit earned by the student for award of degree. This shall be facilitated with the approval of the Dean of the Faculty concern on the recommendations of the respective department. (iii) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-44",
    "content": "of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. 33 | P a g e CHAPTER- 5 - BACHELOR OF EDUCATION (B.Ed.) 1. Eligibility: Candidates should have passed Bachelors Degree and / or Master's Degree and / or equivalent in any discipline from a recognized University with minimum marks in aggregate as prescribed by the Academic Council from time to time, keeping in view the norms of regulatory bodies. 2. Merit Criterion for Admission: Admission to B.Ed. Program shall be made on the basis of merit / rank obtained in the entrance examination conducted by the University or on the basis of marks obtained in qualifying examination. Such admissions shall be completed by a due date notified by the University. 3. Admission: (i) All admissions to the B.Ed. Program shall be made as per the procedure"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-45",
    "content": "prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time.. (ii) Admission and enrolment of students in the program shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the program. (c) The candidates seeking admission to a program of study in the University must fulfill the eligibility criteria in terms of educational qualification, age or any other conditions as may be prescribed for it. (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. 34 | P a g e (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-46",
    "content": "himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 4. Admission of the Candidates who have Gap Years after passing Eligibility Qualification: Such cases shall be governed as per the provisions in the ordinance. The cases relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCrF), guidelines & other similar policies notified from time to time. 5. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 6. Program Structure: (i) Program Duration: (a) B.Ed. programme is a professional course of two years duration. The maximum time span in which a candidate must qualify the degree shall be three academic years, failing which he/ she shall not be allowed to continue his/ her studies for the programme. (b) The programme offered shall be semester based and comprise four semesters. Each semester shall normally be of 13-15 weeks duration. The University may, in addition, introduce mandatory Trainings / Workshops / Courses for the students. The academic departments may assign additional value-added Course/work as well. (c) During the program, the duration of internship will be 20 weeks, involving 4 weeks in first year and 16 weeks in the second"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-47",
    "content": "year. (d) The starting and ending dates of the semesters and the training schedules shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Course of study: The programme may be offered in hybrid mode, face to face or Online mode as decided by the University. The program of study shall consist of the Core and Professional & Open Elective Courses offered. These courses could be offered in combination of various L-T-P modes. Lecture: Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a large class. 35 | P a g e Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Practical Lab: Module of the course aimed at doing practical work using different instruments, equipments, systems or software's etc. to enhance skill component. The program of study shall consist of: (a) Core Courses: Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted. (b) Elective courses: Group of courses in a program where the student has the flexibility of choosing courses of his choice and interest. (c) Workshop courses: These are hand on courses conducted in field/organization /classroom aimed at developing practical skills / application orientation / implementation capabilities / design skills of the student. (d) Non-Teaching Credit Courses: These courses involve no teaching and includes seminars, presentations, dissertations, projects, thesis etc.; (e) Special / Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses / Value added Courses: for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-48",
    "content": "on developing cognitive, affective and psychomotor skills. (f) Training Modules: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be organized during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This training could be organized in an industry / research organization or other institutions, as well. (g) Bridge Courses: Courses introduced to enhance the basic knowledge and skills of the students prior to undertaking advance courses of the Program. These courses will not carry any credit and will not be counted for SGPA or CGPA calculations; (h) Mandatory Course: Any additional Compulsory courses prescribed by the Department / University, which may or may not be an audit courses. (i) Any other course: The department may prescribe any course, which in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (iii)Program Credit requirement University shall follow the choice based credit system. The total credit requirement for the award of the B.Ed. degree shall be as prescribed in the approved scheme of the B.Ed. Program. A 36 | P a g e student can earn a maximum of 40% of the total credits through MOOCs. The credit earned by the students through online / contact mode from any national / international institutions with prior approval of the University shall be counted in his /her credits earned, as per the weightage recommended by the Committee (The mapping Committee) constituted by the University for the purpose."
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-49",
    "content": "(iv)Lower and Upper Limits for Credits Registered: A student has flexibility in terms of registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be able to take up the full academic rigor he/she may register for less credit of a minimum of 14 credits to maintain his / her continuity in the program. Student has also choice to register for a maximum of 32 Credit in a semester, if he / she wishes to complete the program either at faster pace, provided has a CGPA of more than 8.0 or needs to register for previous semester courses due to detention. 7. Attendance: A student of Education Program (UG/PG) shall be required to have a minimum attendance of 80% for all course work and practicum to be eligible for appearing in end semester examination. Also, he/she should have 90% minimum attendance for school internship as per guidelines prescribed by the Regulatory Bodies from time to time. 8. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as the guidelines prescribed in the MRU (Examination) Regulation as amended from time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and fails to deposit the prescribed fee within the stipulated period. (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-50",
    "content": "of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. Departments may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper knowledge through active exploration of real-world challenges and problems. It shall be the responsibility of concerned head of the Department in consultation with Board of Study to finalize the scheme of evaluation for particular courses and same shall be 37 | P a g e recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. The assessment for practical courses shall be done through one End Term Practical Examination (PT). Summer training shall culminate in submission of project report and its evaluation"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-51",
    "content": "by departmental committee. School Internship Program shall be evaluated with help of reflective journal by student teachers, observation by mentors, practical exams and files preparation etc. The mode of evaluation shall be announced at the beginning of the School Internship Program. Students should register for courses on NPTEL/MOOCS/other online platforms before the commencement of the course and these courses shall be duly approved by the department, at the time of registration of the semester. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. Student may also earn credits through innovation, internship, MOOCs etc. and shall be credited to the students account after proper assessment. 9. Preparation and Declaration of Results All norms for preparation and declaration of results prescribed in the MRU (Examination) Regulation, 2022 shall be followed. 38 | P a g e 10. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the ordinance / regulation on prevention of unfair means in the examination . 11. Examination Grievance Committees Committee shall be constituted as per the provisions prescribed in the MRU (Examination) Regulation, 2022. 12. Graduation Requirements: (i) Minimum Credits: The total credit requirement for the award of B.Ed. degree shall be around 85. These credits should be earned under different categories as follows: A student shall register and earn credits for: (a) All core courses as defined in curriculum scheme (b) School internship (c) Summer trainings as specified in the Program Structure. (d) At least two elective courses offered by parent department; (e) At least one elective course offered by allied departments. (f) At least one course through online platform Student shall also pass"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-52",
    "content": "all University mandatory courses, audit courses and shall fulfill any other requirement as prescribed by the University from time to time. (ii) Credits Earned at Different Universities / Institutes: Credits earned by a student through course work / project work / internship at other Institutions / Industry / Organization in India or abroad shall be counted towards total credit earned by the student for award of degree. This shall be facilitated with the approval of the Dean of the Faculty concern on the recommendations of the respective department. (iii) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; 39 | P a g e The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-53",
    "content": "and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. 40 | P a g e CHAPTER: 6 - B.A. LL.B. (H.) & B.B.A. LL.B. (H.) PROGRAMS 1. Eligibility: Candidates should have passed 10+2 Examination from a recognized Board / University, with minimum marks in aggregate as prescribed by the Academic Council from time to time, keeping in view the norms of regulatory bodies. The candidate having passed from any stream including humanities, commerce, sciences or any combination of subjects, is eligible for admission in Law Programs. 2. Merit Criterion for admission: Admission to Integrated Law Honours Programs shall be made on the basis of marks or grades obtained in qualifying examination and achievements in co-curricular and extra-curricular activities or on the basis of marks / grade obtained in the entrance test conducted by the University or any other national level entrance test prescribed. Such admissions shall be made as per admission schedule notified by the University. 3. Admission: (i) All admissions to the Integrated Law Honours program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time, through the Admission Committee. (ii) Admission and enrolment of students in the program shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs. (c) The candidates seeking admission to a program of study in the University must fulfill"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-54",
    "content": "the eligibility criteria in terms of educational qualification, age or any other conditions as may be prescribed for it. (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he / she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to a particular program, he / she shall be given a unique and permanent enrolment / registration number. He / She shall be issued an identity card, 41 | P a g e bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 4. Migration from other Universities / Migration to other University: Such cases shall be governed as per the provisions in the ordinance. 5. Admission of the Candidates who have Gap Years after passing Eligibility Qualification: Such cases shall be governed as per the provisions in the ordinance. 6. Withdrawal of admission and fee refund"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-55",
    "content": "A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 7. Program Structure: (i) Program Duration: (a) The Integrated Law Honours programs are full-time undergraduate programs of five years' duration. The maximum time span in which a candidate must qualify the degree shall be Seven Academic Years, failing which he/she shall not be allowed to continue his/her studies for the program. (b) The Law programs offered shall be semester based and comprise ten Semesters. Each semester shall normally be of 18-20 weeks duration, which is in compliance with the applicable rules and regulations of the Bar Council of India (BCI). (c) For a program, the academic year shall normally comprise Odd Semester, Even Semester and internship (normally in the months of May, June & July). (d) The starting and ending dates of the semesters and the internship schedules shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Course of Study: The program of study shall consist of the Core and Elective Courses offered as prescribed by the BCI Rules of Legal Education in force. These courses could be offered in combination of various L-T- C 42 | P a g e Lecture: Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a large class. Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Clinical Legal Education Component: Moot"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-56",
    "content": "Court / Seminar / Project Assignments, Module of the course aimed at enhancing advocacy skills as mandated by the BCI Rules of Legal Education in force. The program of study shall consist of: (a) Core Courses: comprises of group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted. (b) Elective Courses: comprises of group of courses in a program where the student has the flexibility of choosing courses of his choice and interest. (c) Non-Teaching Credit Courses: These courses involve no teaching. These shall include seminars, presentations, dissertations, projects, thesis etc.; (d) Special / Value Added Courses for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills. (e) Internship : Each registered student in the five year Integrated Program shall complete minimum of 20 weeks internship during the entire period of legal studies under NGO, Trial and Appellate Advocates, Judiciary, Legal Regulatory Authorities, Legislatures and Parliament, Other Legal Functionaries, Market Institutions, Law Firms, Companies, Local Self Government and other such bodies as the University may stipulate, where law is practiced either in action or in dispute resolution or in management. Provided that internship in any year cannot be for a continuous period of more than four weeks and all students shall at least go through once in the entire academic period with Trial and Appellate Advocates. (f) Summer Training: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be organized during summer or"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-57",
    "content": "extended over a period of time including regular semester period for the desired outcome to be achieved. This Internship could be organized in an industry / research organization or other institutions specified above. 43 | P a g e (g) Bridge Courses: Courses introduced to enhance the basic knowledge and skills of the students prior to undertaking advance courses of the Program. These courses will not carry any credit and will not be counted for SGPA or CGPA calculations; (h) Mandatory Course: Any additional Compulsory courses prescribed by the University which may or may not be an audit course. (i) Any other course: The department may prescribe any other course which in their opinion will add value to the student in terms of knowledge and skills and the student shall have to take that course which may or may not earn any credits. (iii) Program Credit Requirement: University shall follow the choice based credit system. The total credit requirement for the award of the B.A.LL.B (H.), B.B.A. LL.B. (H.) and B. Com. LL.B. (H.) degree shall be around 235. The number of courses and the credits assigned to them shall be as per the BCI Rules of Legal Education. (iv) Lower and Upper Limits for Credits Registered: A student has flexibility in terms of registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be able to take up the academic rigor, he / she may register for a minimum of 14 credits to maintain his / her continuity in the program. Student has also choice to register for a maximum of 32 credits in a semester, if he / she wish to complete the program either at a faster pace or needs"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-58",
    "content": "to register for previous semester courses due to detention. 8. Attendance: (i) No student of Law Program (UG / PG) shall be allowed to take the End Semester Test / Examination in a subject, if the student concerned has not attended minimum of 70% of the classes, held in the subject concerned as also the Moot Court room exercises, tutorials and practical trainings conducted in the subject together. Provided that, if a student for any exceptional reason fails to attend 70% of the classes held in any subject, the Dean of the University / Vice Chancellor may allow the student to take the test, if the student concerned attended at least 65% of the classes held in the subject concerned and attended 70% of classes in all the subject taken together Provided further that, a list of such students allowed to take the test with reason recorded be forwarded to the Bar Council of India. Dean of concerned School shall announce the names of all such students who are not eligible to appear in a particular course/courses, normally within a week of end of classes and intimate the same to the Controller of Examinations for further necessary action. 44 | P a g e 9. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as per the guidelines prescribed in the MRU (Examination) Regulations or as amended from time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-59",
    "content": "satisfy the criteria for attendance and deposit the prescribed fee within stipulated date. (ii) Evaluation: The University shall follow a policy of continues evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. Departments may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper knowledge through active exploration of real- world challenges and problems. It shall be the responsibility of concerned head of the department in consultation with Board of Study to finalize the scheme of evaluation for particular courses and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. Students may be asked to register for courses on NPTEL/MOOCS/other online platforms duly approved by the University. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. 45 | P a g e The final evaluation of a course shall be based on"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-60",
    "content": "internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. The assessment for practical courses shall be done through one End Term Practical Examination (PT). Summer training shall culminate in submission of project report and its evaluation by departmental committee. 10. Preparation and Declaration of Results: All norms for preparation and declaration of results prescribed in the MRU (Examination) Regulation, 2022 shall be followed. 11. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the regulation on prevention of unfair means in the examination. 12. Examination Grievance Committees: shall be constituted as per provisions in the regulation for conduct of examination. 13. Graduation Requirements: (i) Minimum Credits: Candidate shall have to earn the minimum credits as per the approved scheme of program to become eligible for the award of degree. These credits should be earned under different categories as follows: A student shall register and earn credits for (a). All core courses as specified in the program structure in force; (b). Number of elective courses as specified in the program structure in force; (c). All Internships / trainings as specified in the program structure in force; Note: Students shall also pass all mandatory courses, audit courses and shall fulfill any other requirement as prescribed by the Department from time to time. 46 | P a g e (ii) Credits earned at different universities/Institutes: Credits earned by a student through course work / project work / internship at other recognized Institutions / Industry / Organization in India or abroad"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-61",
    "content": "shall be counted towards total credit earned by the student for award of degree. This shall be facilitated with the approval of the Dean of the Faculty concerned on the recommendations of the respective department. (iii) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. 47 | P a g e CHAPTER:7 - BACHELOR OF BUSINESS ADMINISTRATION (BBA) 1. Eligibility: Candidates having passed 10+2 examination in Commerce/ Arts / Sciences from a recognized Board / University, or equivalent examination with minimum marks in aggregate of all"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-62",
    "content": "subjects including English Language as prescribed by Academic Council, shall be eligible to apply for admission to a BBA program. 2. Merit Criterion for admission: Admission to the BBA Program shall be made on the basis of grades /marks obtained in the qualifying examination and achievements in co-curricular and extra-curricular activities or on the basis of marks / grade obtained in the entrance test conducted by the University. Such admissions shall be made as per admission schedule notified by the university. 3. Admission: (i) All admissions to the BBA. program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time, through Admission Committee. (ii) Admission and enrolment of students in the programs shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs. (c) The candidates seeking admission to a program of study in the University must fulfill the eligibility criteria in terms of educational qualification, age or any other conditions as may be prescribed for it. (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-63",
    "content": "a particular program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 48 | P a g e 4. Migration from other Universities / Migration to other University: Such cases shall be governed as per the provisions in the ordinance. 5. Admission of the Candidates who have Gap Years after passing Eligibility Qualification: Such cases shall be governed as per the provisions in the ordinance. The cases relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCrF), guidelines & other similar policies notified from time to time. 6. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-64",
    "content": "for that admission year. 7. Program Structure: (i) Program Duration: (a) The University shall offer BBA programs in various functional and sectoral specializations and areas. It is a full time degree awarding undergraduate program of three years duration. The maximum period in which a candidate must qualify for the degree shall be five academic years failing which candidate shall not be allowed to continue studies for the program. (b) The program offered shall be semester based and comprise six semesters. Each semester shall normally be of about 13 - 15 weeks duration. The University may, in addition, offer mandatory Trainings/ Internship / Workshops / Courses etc. for the students. Special classes may be conducted during semester as well. (c) For a program the academic year shall normally comprise of Odd semesters (Aug -Dec), even semesters (Jan -May) and a Training / internship period. Any of the semesters may be for On Job Training /Internship or Project work. (d) The starting and ending dates of the semesters and the Training / Internships schedules shall be announced in the academic calendar of the program in advance. (e) The minimum working days and teaching hours per week will be defined and followed as per respective regulatory authorities and University requirements. Inter-semester break may be utilized for curriculum requirements. (ii) Courses of Study: The programme may be offered in hybrid mode, face to face or Online mode, as decided by the University. The program of study shall consist of the Core and Professional & Open Elective Courses offered. These courses could be offered in combination of various L-T-P modes. Lecture: Presentation & discussion, used to convey theoretical concepts and phenomenon governing business world; development of theories explaining these phenomenon and their applications. Tutorial: A smaller class or group session aimed at problem solving; analysis"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-65",
    "content": "and/or designing by applying that have been discussed in a lecture. Practical Lab: Module of the course aimed at doing practical work using different systems or softwares. 49 | P a g e The program of study shall consist of: (a) Core Courses: Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted. (b) Elective courses: Group of courses in a program where the student has the flexibility of choosing courses of his choice and interest including online courses. (c) Workshop courses: These are hand on courses conducted in field/organization /classroom aimed at developing practical skills / application orientation / implementation capabilities / design skills of the student. (d) Non-Teaching Credit courses: These courses involve no teaching. They can include seminars, presentations, dissertations, projects, thesis, reflective journal etc. (e) Special / Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses/ Value Added Courses: for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills. (f) Training Modules: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be organized during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This training could be organized in an industry / research organization or other institutions, as well. (g) Bridge courses: Are courses which aim to impart basic knowledge and skills required to undertake the core and elective courses. They will not carry any credits. (h) Mandatory"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-66",
    "content": "Courses: Any additional Compulsory courses prescribed by the Department / University, which may or may not be an audit courses (i) Any other course: The department may prescribe any course which in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (iii) Programme Delivery In order to provide blended / experiential learning with respect to various specialisations of Bachelor's of Business Administration (BBA), the programme delivery will be in blended mode with approximately 50% of theory components in classroom & approximately 50 % as Industry Internship in Hospitals, Corporates, Start-ups, SMEs, MSME, etc. (iv) Program Credit requirement: University shall follow the choice based credit system as defined under the ordinance entitled 'Credit System'. The minimum credit requirement for award of the BBA degree shall be around 130-135. A student is allowed to register for lesser or higher credits in a semester with the prior permission of Dean of Faculty. 50 | P a g e (v) Lower and Upper Limits for Credits Registered: A student has flexibility in terms of registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be able to take up the full academic rigor he/she may register for a minimum of 14 credits to maintain his / her continuity in the program. Student has also choice to register for a maximum of 32 Credit in a semester, if he / she wishes to complete the program either as faster pace or needs to register for previous semester courses due to detention provided has a CGPA of more than 8.0. 8. Attendance: A student shall be"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-67",
    "content": "required to fulfill the attendance criteria as prescribed in the Ordinance. 9. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as the guidelines prescribed in the MRU (Examination) Regulation or as amended from time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and deposit the prescribed fee within the stipulated time. (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. Departments may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper knowledge through active exploration of real-world challenges and problems. It shall be the responsibility of concerned head of the Department in consultation with Board of Study to finalize the scheme of evaluation for particular courses and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a)."
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-68",
    "content": "Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The 51 | P a g e rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. Students should register for courses on NPTEL/MOOCS/other online platforms before the commencement of the course and these courses shall be duly approved by the department, at the time of registration of the semester. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. The assessment for practical courses shall be done through one End Term Practical Examination (PT). Summer training shall culminate in submission of project report and its evaluation by departmental committee. Student may also earn credits through innovation, internship, MOOCs etc. and shall be credited to the students account after proper assessment. (iii) Assessment Parameters and its rubrics for introducing project based learning For course offered under Project based learning mode, classroom deliveries to cover the fundamental concepts. The students would be required to work on a project in a team comprising of 3-4 members. These projects would be based on the fundamental principles of the respective subject that is /are offered in PBL mode and should be preferably on the current societal needs. While working on the project students"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-69",
    "content": "are expected to apply the knowledge of all the subjects they have studied or studying during that semester and provide innovative solutions to the problems undertaken. To illustrate, the courses being offered in PBL Mode shall be evaluated through detailed rubrics at each of the following stages, as mentioned below in five stages as mentioned below: Stage Weightage During week of -Commencement of Session Ideation 10% 3rd - 4th week Analysis 15% 5th - 6th week Design 20% 8th - 9th week Development 25% 11th -12th week Testing & Integration 30% 13th- 15th week Assessment shall be made at various different stages by using detailed rubrics as approved by the department & communicated to students in advance. Assessment may be done by using one or more of the following methods: Query, Tests, MCQs, Group Discussion, Assignment or any other parameter which BOS deems fit before starting the project. The final assessment should be measured by mapping the attainment with respect to objectives as set at the start of the project. 52 | P a g e 10. Preparation and Declaration of Results: All norms for preparation and declaration of results prescribed in the MRU (Examination) Regulation, 2022 shall be followed. 11. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the ordinance / regulation on prevention of unfair means in the examination . 12. Examination Grievance Committees: shall be constituted as per provisions in the First Ordinance for the purpose illustrated in the ordinance. 13. Graduation Requirements (a) Minimum Credits (i) The total credit requirement for the award of the BBA degree shall be around 130-135. These credits should be earned under the different categories i.e. core courses, elective courses, Industry Project / Internship / Family"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-70",
    "content": "Business /Start Up, Audit Courses, Non Teaching Credit Courses, University mandatory courses / Online courses as prescribed by the Department and University from time to time. (ii) Credits earned at different universities/Institutes: Provision shall be made for acknowledgement of credits earned by a student through course work/project work/internship at other Institutions/Industry / Organization in India or abroad. This shall be facilitated with the approval of the Dean of the Faculty concern on the recommendations of the respective department. (iii) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-71",
    "content": "the regulation. 53 | P a g e CHAPTER:8 - B. Ed. SPECIAL EDUCATION (LEARNING DISABILITY) B.Ed. Spl. Ed.(LD) 1. Eligibility: Candidates should have passed Bachelor's Degree and / or Master's Degree and / or equivalent in any discipline from a recognized University with minimum marks in aggregate as prescribed by the Academic Council from time to time, keeping in view the norms of regulatory bodies. 2. Merit Criterion for Admission: Admission to B.Ed.Spl.Ed.(LD) Program shall be made on the basis of merit / rank obtained in the entrance examination conducted by the University or on the basis of marks obtained in qualifying examination. Such admissions shall be completed by a due date notified by the University. 3. Admission: (i). All admissions to the B.Ed.Spl.Ed. (LD)Program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time. (ii). Admission and enrolment of students in the program shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the program. (c) The candidates seeking admission to a program of study in the University must fulfill the eligibility criteria in terms of educational qualification, age or any other conditions as maybe prescribed for it. (iii). No candidate shall be entitled to claim admission as a matter of right. (iv). The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v)."
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-72",
    "content": "Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi). After the student is admitted to a particular program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in 54 | P a g e all communications with the University and in subsequent applications for an examination of the University. (vii). A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 4. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 5. Migration from other Universities / Migration to other University: Such cases shall be governed as per the provisions in the ordinance. 6. ADMISSION OF THE CANDIDATES WHO HAVE GAP YEARS AFTER PASSING ELIGIBILITY QUALIFICATION: Such cases shall be governed as per the provisions in the ordinance. The cases"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-73",
    "content": "relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCrF), guidelines & other similar policies notified from time to time. 7. Program Structure: (i) Program Duration: (a) B.Ed.Spl.Ed. (LD) is a professional program of two years duration. Normally, the maximum time span in which a candidate must qualify the degree shall be three academic years, failing which he / she shall not be allowed to continue his / her studies for the programme. (b) The programme offered shall be semester based and comprise four semesters. Each semester shall normally be of 13 - 15 weeks duration. The University may, in addition, introduce mandatory Trainings/ Workshops / Courses for the students. The academic departments may assign additional value-added Course/work. (c) In the first year (First two semesters), there shall be work on the field amounting to a minimum of 4 weeks, spread over several days throughout the semester/ year. This will include minimum of one week of school engagement and three weeks of other practical work/engagements. In the second year (Third and Fourth 55 | P a g e semesters), there shall be a minimum of 16 weeks of engagement with the field of which minimum of 15 weeks are for school internship and one week is for other field engagements. Thus a minimum of 20 weeks (4+16) shall be allocated over the two years for tasks, assignments as per the courses and school internship in the field, under the broad curricular areas of Practical related to Disability and Field Engagement (d) The starting and ending dates of the semesters and the training schedules shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Course"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-74",
    "content": "of study: The programme may be offered in hybrid mode, face to face or online mode as decided by the University. The program of study shall consist of the Core and Elective Courses offered. These courses could be offered in combination of various L-T-P modes or as decided by respective BOS and Academic Council. Lecture: Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a large class. Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Practical Lab: Module of the course aimed at doing practical work using different instruments, apparatus, systems or software's. The program of study shall consist of: (a) Core Courses: Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted. (b) Elective courses: Group of courses in a program where the student has the flexibility of choosing courses of his choice and interest. (c) Workshop courses: These are hand on courses conducted infield/ organization/ classroom aimed at developing practical skills/ application orientation/ implementation capabilities/ design skills of the student. (d) Non-Teaching (self study) Credit Courses: These courses involve no teaching and includes seminars, presentations, dissertations, projects, thesis etc.; (e) Special / Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses / Value added Courses: For development of specific skills and other consanguine abilities, these courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills. 56 | P a g e (f) Training Modules: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-75",
    "content": "purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be organized during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This training could be organized in an industry/ research organization or other institutions. (g) Bridge Courses: Courses introduced to enhance the basic knowledge and skills of the students prior to undertaking advance courses of the Program. These courses will not carry any credit and will not be counted for SGPA or CGPA calculations; (h) Mandatory Course: Any additional courses prescribed by the University which may or may not be an audit courses. (i) Any other course: The department may prescribe any course, which in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (iii) Program Credit requirement University shall follow the choice based credit system. The total credit requirement for the award of the B.Ed.Spl.Ed. (LD) degree shall be as prescribed in the approved scheme of the B.Ed.Spl.Ed. (LD) Program. A student can earn a maximum of 40% of the total credits through MOOCs. The credit earned by the students through online / contact mode from any national / international institutions with prior approval of the University shall be counted in his /her credits earned, as per the weightage recommended by the Committee (The mapping Committee) constituted by the University for the purpose. (iv) Lower and Upper Limits for Credits Registered: A student has flexibility in terms of registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-76",
    "content": "able to take up the full academic rigor he/she may register for less credit of a minimum of 14 credits to maintain his / her continuity in the program. Student has also choice to register for a maximum of 32 Credit in a semester, if he / she wishes to complete the program either at faster pace, provided has a CGPA of more than 8.0 or needs to register for previous semester courses due to detention. 8. Attendance: The minimum attendance of Student-Teachers shall have to be 80% for all course work, 90% for all practicum, and 100% for school internship (5% attendance may be condoned by the head of institution on genuine grounds). 57 | P a g e 9. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as the guidelines prescribed in the MRU (Examination) Regulation or as amended time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and deposit the prescribed fee within stipulated date. (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. Department may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-77",
    "content": "knowledge through active exploration of real-world challenges and problems. It shall be the responsibility of concerned head of the Department in consultation with Board of Study to finalize the scheme of evaluation for a particular courses and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. The evaluation for courses following L-T-P of 3-1-2 shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. The assessment for practical courses shall be done through one End Term Practical Examination (PT). 58 | P a g e Summer training shall culminate in submission of project report and its evaluation by departmental committee School Internship Program shall be evaluated with help of Case study/IEP/Lesson planning/reflective journal/practical exams etc.The mode of evaluation shall be announced at the beginning of the School Internship Program. Students should register for courses on NPTEL/MOOCS/other online platforms before the commencement of the course and these courses shall be"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-78",
    "content": "duly approved by the department, at the time of registration of the semester. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. Student may also earn credits through innovation, internship, MOOCs etc. and shall be credited to the students account after proper assessment. 10. Preparation and Declaration of Results All norms for preparation and declaration of results prescribed in the MRU (Examination) Regulation, 2022 shall be followed. 11. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the ordinance/regulation on prevention of unfair means in the examination. 12. Examination Grievance Committees Committee shall be constituted as per the provisions prescribed in the MRU (Examination) Regulation, 2022. 13. Graduation Requirements: (a) Minimum Credits: The minimum credit requirement for the award of B.Ed.Spl.Ed. (LD) degree shall be around 80. These credits should be earned under different categories as follows: A student shall register and earn credits for: (i). All core courses as defined in curriculum scheme (ii). School internship (iii). At least two elective courses offered by parent department; (iv). At least one elective course offered by allied departments. (v). At least one course through online platform (will be applicable from 2021-22 batch onwards) Minimum 50% marks are essential in all courses for passing in the programme. 59 | P a g e Student shall also pass all University mandatory courses, audit courses and shall fulfill any other requirement as prescribed by the University from time to time. (b) Credits Earned at Different Universities/Institutes: Credits earned by a student through course work / project work / internship at other Institutions /Industry / Organization in India or abroad shall be"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-79",
    "content": "counted towards total credit earned by the student for award of degree. This shall be facilitated with the approval of the Dean Academics on the recommendations of the respective department. A prior approval of the Department is required to earn these credits from any other institution. A student may also get credit redeemed if earned through Academic Bank of Credit. (c) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. 60 | P a g e CHAPTER: 9 - MASTER IN BUSINESS ADMINISTRATION (MBA) The University"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-80",
    "content": "shall offer MBA programme in Full Time, Part Time and Executive mode. The duration of MBA (Full Time) programme will be two years, MBA (Executive) fourteen months to two years and MBA (Part Time) three years. The maximum time span in which a candidate must qualify for the degree shall be four academic years for Full Time program, five academic years for Part Time program and three to four academic years for MBA Executive programme, failing which candidate shall not be allowed to continue in the program. 1. Eligibility: (i) The candidate for MBA Full Time & MBA Part Time programmes, should have passed Bachelor's Degree in any discipline from a recognized University or equivalent with minimum marks in aggregate as notified by the University from time to time, keeping in view the norms of statutory bodies or pass in final examination conducted by Institute of Chartered Accountant of India / Institute of Costs and Works Accountants of India / Institute of Company Secretaries of India. (ii) For MBA executive programme the candidate, in addition to satisfying the eligibility norms of the MBA Full Time & MBA Part Time programme, should have work experience as notified by the University from time to time. (iii) All candidates shall be required to complete all admission related requirements before a final cutoff date declared by the University. 2. Merit Criterion: Admission to the MBA programme shall be made on the basis of merit in National Level Entrance Examination or on the basis of Entrance Examination conducted by the University. The University may introduce additional group discussion and / or personal interview. Such admissions shall be completed by a due date notified by the University. 3. Admission: (i) All admissions to the MBA Program shall be made as per the procedure prescribed by the"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-81",
    "content": "Academic Council and approved by the Board of Management and notified in the admission brochure from time to time.. (ii) Admission and enrolment of students in the program shall be regulated in the manner as below: (a) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local' newspapers and / or other media and also uploaded on the University website. (b) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs. (c) The candidates seeking admission to a program of study must fulfill the eligibility criteria in terms of educational qualification, age or any other conditions as may be prescribed for it. 61 | P a g e (iii) No candidate shall be entitled to claim admission as a matter of right. (iv) The maximum number of seats in each program shall be determined by the Board of Management from time to time. (v) Every student shall be required to sign a declaration to the effect that he/she submits himself to the disciplinary jurisdiction and rules of the University. (vi) After the student is admitted to a particular program, he /she shall be given unique and permanent enrolment / registration number. He / She shall be issued an identity card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. (vii) A student applying for change of his/her name in the record of the University should submit his/her application to the Registrar accompanied by (i) The prescribed fee; (ii) An Affidavit relating to his/her present and proposed name, duly sworn in the presence of a Magistrate by himself/herself; (iii) A publication"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-82",
    "content": "from a newspaper in which the proposed change of name has been advertised. However, the provision relating to publication shall not be applicable in case where a woman student wants to change her name following her marriage in which case marriage certificate indicating the new name shall be valid. 4. Admission of the Candidates who have Gap Years after passing eligibility qualification Such cases shall be governed as per the provisions in the ordinance. The cases relating to Multiple Entry & Multiple Exit shall be dealt as per National Skill Quality Framework (NSQF), National Qualification Framework (NQF) and National Credit Framework (NCF), guidelines & other similar policies notified from time to time. 5. Withdrawal of admission and fee refund A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. 6. Program Structure: (i) Programme Duration: (a) The programme offered shall be semester based and comprise four semesters for Full Time programme and six semesters for the Part Time programme. Each semester shall normally be of twenty weeks duration. The University may in addition, introduce mandatory Trainings / Workshops / Courses for the students. The academic departments may assign additional value-added Course/work as well. (b) For a program the academic year shall normally comprise odd semester & even semester. The starting and ending dates of the semesters and the training schedules shall be announced in the Academic Calendar of the program. 62 | P a g e (c) For a program the academic year shall normally comprise odd semester (Aug - Dec), even semester"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-83",
    "content": "(Jan - May) and a summer training period (normally in the months of May, June & July). (d) The starting and ending dates of the semesters and the training schedules shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Courses of Study: The programme may be offered in hybrid mode, face-to-face or online mode as decided by the University. The program of study shall consist of the Core and Professional & Open Elective Courses offered. These courses could be offered in combination of various L-T-P modes. The various courses shall comprise one or more of following components: Lecture (L): Presentation & discussion, used to convey development of theories and/or systems; their applications; current status and future prospects to a class. Tutorial: A smaller class or group session aimed at problem solving; analysis and/or designing by applying what have been discussed in a lecture. Practical (P) Lab: Module of the course aimed at doing practical work using different instruments, equipments, , systems or software's etc. to enhance skill component. The program of study shall consist of: (a) Core Courses(≅ 60%): Group of courses specifically required for a given program of study. These are compulsory for a student and no exemption is granted; (b) Elective Courses: Group of courses in a program where the student has the flexibility of choosing courses of his choice and interest. (c) Non-Teaching Credit Courses: These courses involve no teaching and includes seminars, presentations, dissertations, projects, thesis etc.; (d) Special / Skill based Courses / Ability Enhancement Courses/ Bhartiya Bhasha Courses / Value added Courses: for development of skills and other consanguine abilities. These courses are specially designed to address different scholastic abilities of students. These courses would focus on developing cognitive, affective and psychomotor skills."
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-84",
    "content": "(e) Training Modules: Objective of training modules shall be to enhance the employability and entrepreneurial skills of the students. These modules shall be suitably designed with the purpose of developing hard and soft skills of the students and shall stress upon 'learning by doing'. Modules can be organized during summer or extended over a period of time including regular semester period for the desired outcome to be achieved. This 63 | P a g e training could be organized in an industry / research organization or other institutions, as well. (f) Mandatory Course: Any additional Compulsory courses prescribed by the University, which may or may not be an audit courses (g) Any other course: The department may prescribe any course which in their opinion will add value to the student in terms of knowledge, behavior and skills and the student shall have to take that course which may or may not earn any credits. (h) Dissertation: The Objective of dissertation is to allow Post Graduate students to experience and learn the methodologies of carrying out research work in a domain which may be interdisciplinary in nature. (iii) Programme Credit Requirement: University shall follow the choice based credit system. The total credit requirement for the award of the MBA degree (full time, part time, executive) shall be 100-110 credits depending upon the specified curriculum & scheme of examination of the programme. These credits shall be earned under different categories as specified by the curriculum scheme. (iv) Lower and Upper Limits for Credits Registered: A student has flexibility in terms of registering the credits during the semester. Due to any unavoidable circumstances, ill health or any other reason, if a student feels that he / she would not be able to take up the academic rigor may register for less credit of"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-85",
    "content": "a minimum of 12 credits to maintain his / her continuity in the program. Student has also choice to register for a maximum of 30 Credit in a semester, if he / she wishes to complete the program either at faster pace, provided has a CGPA of more than 8.0 or needs to register for previous semester courses due to detention. 7. Attendance: A student shall be required to fulfill the attendance criteria as prescribed in the Ordinance. 8. Conduct of Examination & Evaluation: (i) Conduct of Examination: (a) The University shall conduct examinations as the guidelines prescribed in the MRU (Examination) Regulation or as amended from time to time and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (b) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and deposit the prescribed fee within stipulated time. 64 | P a g e (ii) Evaluation: The University shall follow a policy of continuous evaluation of student's learning with an objective of training a student to put in sustained, steadfast and disciplined effort over the entire period of study. Departments may also follow Project Based Learning Model for a course or group of courses, as approved by the Academic Council on the recommendation of Board of studies, as a teaching method in which students acquire a deeper knowledge through active exploration of real-world challenges and problems. It shall be the responsibility of concerned head of the Department in consultation with Board of Study to finalize the scheme of evaluation for particular courses"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-86",
    "content": "and same shall be recommended to the Academic Council for its approval. The method adopted for assessment duly approved by Academic Council shall be communicated to the students by the respective Department at the beginning of the session and shall be conducted under the continuous monitoring of the Head of the Department and faculty member(s) nominated for this purpose. Normally, the evaluation for courses shall be done in three stages viz.- (a). Mid-Term Examination (weightage 20%) (b). Continuous Assessment (30% weightage) (c). End-term Examination (50% weightage) On recommendation of BOS, a subjects can be assessed through any other method. The rubrics to achieve the desired outcome (CO and PO) shall be approved by BoS and shared with students. The final evaluation of a course shall be based on internal assessment and end semester examination and the internal assessment (with a maximum of thirty per cent. marks) based on instruments such as discussion forums, quizzes, assignments, sessional examinations and the complete evaluation scheme of a course shall be announced at the time of launch of the course. Students should register for courses on NPTEL/MOOCS/other online platforms before the commencement of the course and these courses shall be duly approved by the department, at the time of registration of the semester. The evaluation of such courses may be based on the guidelines and shall be done on the basis of pre-decided rubrics communicated by concerned faculty to the students. The assessment for practical courses shall be done through one End Term Practical Examination (PT). Summer training shall culminate in submission of project report and its evaluation by departmental committee. Student may also earn credits through innovation, internship, MOOCs etc. and shall be credited to the students account after proper assessment. 65 | P a g e (iii) Assessment Parameters and its rubrics"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-87",
    "content": "for introducing project based learning For course offered under Project based learning mode, classroom deliveries to cover the fundamental concepts. The students would be required to work on a project in a team comprising of 3-4 members. These projects would be based on the fundamental principles of the respective subject that is /are offered in PBL mode and should be preferably on the current societal needs. While working on the project students are expected to apply the knowledge of all the subjects they have studied or studying during that semester and provide innovative solutions to the problems undertaken. To illustrate, the courses being offered in PBL Mode shall be evaluated through detailed rubrics at each of the following stages, as mentioned below in five stages as mentioned below: Stage Weightage During week of -Commencement of Session Ideation 10% 3rd - 4th week Analysis 15% 5th - 6th week Design 20% 8th - 9th week Development 25% 11th -12th week Testing & Integration 30% 13th- 15th week Assessment shall be made at various different stages by using detailed rubrics as approved by the department & communicated to students in advance. Assessment may be done by using one or more of the following methods: Query, Tests, MCQs, Group Discussion, Assignment or any other parameter which BOS deems fit before starting the project. The final assessment should be measured by mapping the attainment with respect to objectives as set at the start of the project. (iv) Examination and Evaluation of Dissertation/ Project Work: (a) Dissertation/Project: The dissertation/project work will be carried out during fourth semester. The evaluation stages for dissertation/project work shall be as given in the Table Evaluation Stage Time Line Weightage Conditions Stage 1: Approx 5 weeks into the semester 20% Student failing to secure at least 20% marks allocated to"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-88",
    "content": "dissertation/project work, shall not be allowed to proceed to the End semester evaluation Stage 2: Approx 10 weeks into the semester 20% 66 | P a g e Stage 3: At the end of the semester 60% Evaluation shall have two equal components: 1. Project presentation 2. Viva Examination (by Committee set up by the department having at least one examiner from outside the University) (b) Submission of Dissertation: The student shall submit an electronic copy of the Dissertation in the prescribed format to the Department, as per schedule. Upon receiving of satisfactory report from the external examiner the student shall submit three soft bound copies of the dissertation to the department. (c) Dissertation Evaluation: (i) APPOINTMENT OF THESIS SUPERVISOR(S) AND CONSTITUTION OF THESIS EXAMINATION BOARD (a) Appointment of Thesis Supervisor(s) (i) It shall be the responsibility of the Department to allocate Thesis Supervisor to all the registered students. A Student shall be allotted Thesis Supervisor preferably during the third semester. (ii) A student shall not normally have more than two supervisors at any given time. (iii) Thesis supervisor(s) of a student shall be appointed amongst the Faculty Members of the University in the manner prescribed by the department and approved by Dean, Academics. Normally, a Faculty Member shall not supervise more than five students of masters program. However the Department may evolve a transparent policy for the distribution of students amongst the Faculty Members in the Department. (iv) A student on the recommendation of the HoD can have a co-supervisor from outside the University. (v) In case, there has been a change / addition in the supervisor(s) such changes shall not be permitted within the last three month of program duration. (vi) If a student's supervisor proceeds on long leave (more than 3 months) and if there is only"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-89",
    "content": "one supervisor, then prior to proceeding on such a leave, HOD in consultation with Dean of Faculty and the student, shall appoint a thesis coordinator to ensure that the student's work does not suffer in his/her absence. Further, if all research work and related analysis is complete except writing of the thesis and the supervisor proposes to go on leave, the Thesis coordinator / HOD shall take care of the formalities. (vii) In case a supervisor resigns / retires or otherwise ceases to be a Faculty Member of the University, the HOD shall appoint a new supervisor or co-supervisor in consultation with the student. 67 | P a g e (viii) In case a Faculty Member is suspended / debarred by the University for indulging in lowering the prestige of the University in any manner, he/she shall cease to be a thesis supervisor. (b) Constitution of Thesis Examination Board The Examination Board for evaluation of the thesis shall consist of (i) One Faculty from the University / Outside University form the same area (ii) One Faculty from the Department having expertise in the area of thesis. (iii) Thesis Supervisor(s): Thesis supervisor shall recommend the names of the examination board to the Dean Academics for its approval. The Board shall give its recommendation for accepting or rejection of the thesis and the same shall be sent to the office of Controller of Examination. (ii) THESIS SUBMISSION AND EXAMINATION (a) After the Examination Board is constituted, unbound copies of the thesis report one for each examiner of the Examination Board shall be prepared according to the format prescribed. (b) All the work carried out as part of the dissertation shall be screened using the software for plagiarism and in case the report shown is more than permissible limit, the dissertation report has"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-90",
    "content": "to be resubmitted. A certificate that no part of the Thesis is plagiarized has to be submitted by the student. Thesis shall be submitted at least a week before the probable date of Oral Examination. The HOD shall arrange to send the soft copies of the thesis to the examiners appointed by the Dean Academics. The examiner shall evaluate and grade the dissertation for presentation, organization and content and send the report to the office of Controller of Examinations. After the final Viva Voce, the modifications suggested if any by the Examination Board, may be incorporated in the thesis and three copies of the thesis be submitted to the Examination Section. 9. Preparation and Declaration of Results: All norms for preparation and declaration of results prescribed in the MRU (Examination) Regulation, 2022 or as amended from time to time, shall be followed. 10. Use of Unfair Means: All cases regarding reported use of Unfair Means in the examination shall be dealt as per the provisions under the ordinance / regulation on prevention of unfair means in the examination. 11. Examination Grievance Committees Committee shall be constituted as per provisions in the regulation for conduct of examination. 12. Graduation Requirements: 68 | P a g e (i) Minimum Credits: As specified in the curriculum scheme, completion of minimum number of credits, including all core courses, successful completion of summer training; and successful completion of all stages of dissertation/project work shall be the condition for becoming eligible for the award of degree. In addition, a student shall have to fulfill all other conditions as prescribed by the University from time to time. (ii) Credits Earned at Different Universities / Institutes: Provision shall be made for acknowledgement of credits earned by a student through course work/project work/internship at other institutions in India or"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-91",
    "content": "abroad. This shall be facilitated with the approval of Vice-Chancellor on the recommendation of the respective Dean. (iii) Academic Bank of Credit The University shall facilitate to open an individual account with the Academic Bank of Credits opened and operated by a student, to which all academic credits earned by the Student from course(s) of study are deposited, recognised, maintained, accumulated, transferred, validated or redeemed for the purposes of the award of degree/diploma/certificates etc. by the University and other provisions in accordance with the regulations prescribed by the UGC (Establishment and Operation of Academic Bank of Credits in Higher Education) Regulations, 2021 and amended from time to time ; The norms in respect to the curriculum content, curriculum transaction, educational technologies for the courses offered, their timing, continuous evaluation methods, attendance and novel methods of assessment shall be as per the academic regulation prescribed by the University consistent with the overarching policy and philosophy of holistic, multidisciplinary education under National Education Policy-2020. Credits earned and deposited with ABC shall be valid for the purpose of redemption to a degree or diploma or Post Graduate diploma or certificate, for varying duration as specified by the credit awarding and credit accepting Institution subject to a maximum duration of seven years. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. 69 | P a g e CHAPTER: 10 MASTER OF LAW (LL.M) The University in principle would adopt the UGC guidelines for introduction of one year LL.M. degree programme, 2012. There will be a Centre for Post-Graduate Legal Studies (CPGLS) established at School of Law, Manav Rachna University for administration and implementation of these Regulations. The Centre shall be"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-92",
    "content": "under the charge of a three to five- member committee consisting of Faculty members of School of Law, Manav Rachna University. Chairperson and other Professors, Associate Professors, Assistant Professors shall be nominated by the Vice-Chancellor, Manav Rachna University. PROGRAMME/ COURSE DURATION (i) LL.M. (Full Time) Programme This full-time programme is meant only for those who are not in employment or engaged in any trade, profession and business or occupation. The student is required to give an affidavit for the same at the time of admission. (ii) LL.M. (Part Time) Programme This course is meant for all applicants including those who are in employment or engaged in any trade, profession and business or occupation. Duration of the programme in Part Time mode shall be two years. ELIGIBILITY I. Candidates having passed LLB (3 years) or LLB (5 years) program with 50% or more marks in aggregate as notified by the University keeping in view the norms of statutory bodies. II. All admissions to the LL.M. program shall be made as per the procedure prescribed by the Academic Council and approved by the Board of Management and notified in the admission brochure from time to time, through the Admission Committee. III. Admission and enrolment of students in the Manav Rachna University shall be regulated in the manner as below: (A) An admission notification clearly specifying the admission / enrolment criteria for each program as prescribed by the University shall be published in national / local newspapers and / or other media and also uploaded on the University website. (B) All the admissions shall be made by the Admission Committee as per the eligibility conditions prescribed for the programs offered by the University. (C) The candidates seeking admission to a program of study in the University must fulfill the eligibility criteria in terms"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-93",
    "content": "of educational qualification, age or any other conditions as may be prescribed for it. IV. No candidate shall be entitled to claim admission as a matter of right. V. The maximum number of seats in each program shall be as prescribed from time to time. VI. After the student is admitted to a particular program, he / she shall be given a unique and permanent enrolment / registration number. He / She shall be issued an identity 70 | P a g e card, bearing the same which must be quoted by him/her in all communications with the University and in subsequent applications for an examination of the University. PROGRAM STRUCTURE (i) Program Duration: (a) The University shall offer LL.M program in Full Time and Part-Time mode. The duration of full time program shall be one Academic Year. The duration of program offered in part-time mode shall be of two Academic years. The maximum time span in which a candidate must qualify for the degree for Full-Time shall be two academics years and for the part-time mode maximum time span will be three academics years failing which he/she shall not be allowed to continue his/her studies for the program. (b) The program offered shall be semester based and comprise two semester for Full-Time mode and four semesters for Part-Time mode. Each semester shall be of 18 weeks duration. (c) The starting and ending dates of the semesters shall be as per the academic calendar of the program, as notified by the University from time to time. (ii) Programme Credit requirement: University shall follow the choice based credit system for the LL.M program. The total credit requirement for the award of LL.M Degree, in both modes i.e. Full time and Part time, shall be 25 credits depending upon the specified curriculum"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-94",
    "content": "& scheme of examination of the specific program. CURRICULUM/ COURSE OF STUDY The LL.M. course curriculum shall have the following components with total 25 Credits (i) Foundation/ Compulsory Papers (3 courses of 3 credits each) The Foundation/ Compulsory Papers consist of the following three subjects/ papers: a) Legal Research Methodology b) Comparative Public Law/ Systems of Governance c) Law and Justice in a Globalizing World (ii) Optional/ Specialization papers (6 courses of 2 credits) Specialization courses will be offered in one or more group of the specialization. Each group of specialization shall consist of Six (6) papers. (iii) Dissertation (4 credits) MIGRATION FROM OTHER UNIVERSITIES / MIGRATION TO OTHER UNIVERSITY Such cases shall be governed as per the norms laid down by the University. 71 | P a g e WITHDRAWAL OF ADMISSION AND FEE REFUND A student shall have to submit an application to the Registrar or authorized officer of the University, in case he/she wants to withdraw his/her admission from the program of study in which admitted. He/she will be refunded the fee as per the Fee Refund Policy of the University announced in the admission brochure for that admission year. ATTENDANCE (i) No student of LL.M. Program shall be allowed to take the End Semester Test / Examination in a subject, if the student concerned has not attended minimum of 75% of the classes held in the subject concerned. (ii) Provided that, if a student for any exceptional reason fails to attend 75% of the classes held in any subject, the Dean of the University / Vice Chancellor may allow the student to take the test, if the student concerned attended at least 70% of the classes held in the subject concerned and attended 75% of classes in all the subject taken together. CONDUCT OF EXAMINATION &"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-95",
    "content": "EVALUATION (A) Conduct of Examination: (i) The University shall conduct examinations as per the guidelines prescribed in the MRU (Conduct of Examination) Regulation and shall notify the fees payable by the students for various examinations. A student who has not paid the prescribed fees within the specified time shall be dealt with as per rules of the University and shall not ordinarily be eligible to appear in the examination. (ii) A student may not be permitted to appear in the end-semester examination, if he fails to satisfy the criteria for attendance and deposit the fee as prescribed. (B) Evaluation: The evaluation of students in a course shall broadly be based on two segments. a. Continuous evaluation by the teacher(s) of the course. b. Evaluation through a semester examination. c. The components/ contents of each segment of evaluation, the respective weightage to be given to each segment, and the pattern of examination, will be formulated by the University duly approved in the Academic Council and Board of Studies. d. The end semester examination will not be assigned not more than half of the total marks of the subject. The Dissertation will be evaluated out of a maximum of 200 marks out of which 150 marks shall be for the dissertation and 50 marks for the viva-voce. The dissertation shall be evaluated by the supervisor appointed for the candidate by the CPGLS. The viva-voce will be conducted by a panel of faculty members identified for the purpose. CLASSES AND TIME FRAME (a) The classes for the LLM programme under Full time/ Part time, may be held in offline / online / hybrid mode. 72 | P a g e (b) The classes in the Compulsory/ Foundation Courses may be held jointly for all one year and two years students. (c) University may"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-96",
    "content": "offer 40% of the classes in online / hybrid modes The Vice Chancellor shall have the power to take decision to ease any procedural intricacies in the conduct of this course. All such measures would be tabled in the next meeting of Academic Council for ratification. Nothing in this regulation shall be deemed to preclude the University from amending the regulation and the amended regulation, if any, shall apply prospectively and from the date as specified in the regulation. MANAV RACHNA UNIVERSITY (Declared as State Private University vide Haryana Act no 26 of 2014) Manav Rachna University Student Promotion (First Amendment) Regulations, 2023 Approved in 21st Board of Management Meeting Held on 03rd June 2023 Sector -43, Surajkund Badkhal Road, Aravali Hills, Faridabad- 121004 HARYANA MANAV RACHNA UNIVERSITY Sector 43, Faridabad Manav Rachna University Student Promotion (First Amendment) Regulations, 2023 In exercise of the power conferred by the clause 8 (iv) (e) of the First Statutes, read with section 34 of the Haryana Private Universities Act, 2006, and further amended as Haryana Private Universities (Second Short Title Amendment) Act 2014 (Haryana Act no. 26 of 2014), the Board of Management of the Manav Rachna University hereby makes the Regulation relating to Student Promotion. (1) Short Title, Application and Commencement (a) These Regulation shall be called the Manav Rachna University Student Promotion (First amendment) Regulations, 2023 (b) This shall come in force from July, 2023 (2) Scope These regulations shall apply to student of under graduate programs offered by the University. (3) Definitions: (a) \"Grade Improvement\" shall mean improvement of grade of a course to improve SGPA/CGPA. (b) \"Higher Semester\" shall mean subsequent semesters of the program of studies after first semester. (c) \"Supplementary Examination\" shall mean supplementary examination conducted by the University during odd and even semesters. (d) \"Supplementary Chances\""
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-97",
    "content": "shall mean number of chances to appear in the supplementary examination (e) \"Academic Calendar\" shall mean the schedule of various academic activities that will take place during a particular semester/year Words and expression used but not defined in the Regulation and defined Act, Statute and Ordinances shall have the meaning respectively as assigned them in the Act, Statute and Ordinances. (4) Promotion to Higher Semesters/ Conduct of Supplementary Exam (a) Student shall have to score minimum 40% marks in internal assessments, 40% marks in End term Examination and have to Score 40% marks in Total Assessment (Internal and external) to get a pass grade in a course. (b) Students shall be allowed 2 supplementary chances only to convert the F (Fail) Grade into a P (Pass) Grade. This chance must be availed by the student within 1 year of the declaration of F Grade. The 1st chance should be availed immediately after the Main end term exam and the 2nd chance after a semester. (c) If a grade is not converted to a pass grade in these two chances, the student shall be given chance by re-registering for the previous odd semester courses in the next odd semester on priority, along with all the regular students and for the previous even semester courses by re-registering in next even semester on priority along with all the regular students. (d) Students are required to maintain a minimum CGPA of 5.00 every year otherwise have to go for grade improvement in the subsequent semester/year. 5. Methodology for registration of the courses: i. Students are required to successfully clear their supplementary exams and the pending courses from the previous semester (due to detention or failure in exams) before they can proceed to register for courses in the successive odd/even semesters. ii. If a student"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-98",
    "content": "fails to clear the first-year courses or unable to maintain 5 CGPA till 2nd year, shall not be promoted to the third year. iii. Similarly, if a student fails to clear their second-year courses or unable to maintain 5 CGPA till 3rd year, shall not be promoted to the fourth year. iv. For Integrated Law Programs, if a student fails to clear their third-year courses or unable to maintain 5 CGPA till 4th year, shall not be promoted to the fifth year. 6. Grade Improvement a) Students will be allowed to choose courses to improve their SGPA/CGPA throughout the entire duration of the program. These courses will be indicated as \"Grade Improvement\" during the Course Registration process. (b) The final grade considered for SGPA/CGPA calculations will be the higher of the two grades obtained by the student for the course. However, the student will be required to pay the applicable fees as per University norms. (c) Students wishing to appear for grade improvement will be permitted to take only the end-term examination to improve their grades. Previous internal and mid-term marks will remain valid. (d) If a student is absent for the end-semester examination, the old grades for that subject will be considered, and the student will not be entitled to a re-examination in such cases. (e) If a student fails to secure higher grades through the grade improvement process, resulting in a reduction in their overall CGPA, the original result before registering for grade improvement will be retained. 7. Add / Drop of Courses: a) Students are given the option to add or drop courses from their registered course list for a semester within two weeks of registrations of that semester. This can be done on or before a specific date mentioned in the Academic Calendar. (b) Students have"
  },
  {
    "title": "MRU \\(Academic Programs\\) Regulation, 2022",
    "start_page": 238,
    "chunk_id": "mru-\\academic-programs\\-regulation,-2022-99",
    "content": "the opportunity to add a course within one week of the semester's start, and their attendance will be monitored starting from the day they register for that course. Withdrawal from a course is allowed up to two weeks after the semester begins. To withdraw, students must submit an application on a prescribed form available in the University's Academic Section, after obtaining approval from the Head of the department. (c) During the completion of the registration form or any subsequent changes, every student is required to consult their faculty adviser or the nominated mentor appointed by the respective Departments. Minimum Number of Students to be Registered in an Elective Course: For undergraduate elective courses and specializations in postgraduate courses, the course will be conducted only if there is a minimum registration of 30% of the admitted students, with a minimum requirement of 10 students. Additionally, no elective course shall be offered to a section with more than 60 students. Any deviation from this rule must have prior approval from the Vice Chancellor. For and on behalf of Manav Rachna University Registrar"
  },
  {
    "title": "Guidelines for Research Fellowship \\(RF\\) Scheme",
    "start_page": 314,
    "chunk_id": "guidelines-for-research-fellowship-\\rf\\--1",
    "content": "MANAV RACHNA UNIVERSITY (Declared as State Private University vide Haryana Act no 26 of 2014) Guidelines for Research Fellowship (RF) Scheme Approved in 21st Board of Management Meeting Held on 03rd June 2023 Sector -43, Surajkund Badkhal Road, Aravali Hills, Faridabad- 121004 HARYANA"
  },
  {
    "title": "Guidelines for Research Fellowship \\(RF\\) Scheme",
    "start_page": 315,
    "chunk_id": "guidelines-for-research-fellowship-\\rf\\--1",
    "content": "MANAV RACHNA UNIVERSITY GUIDELINES FOR RESEARCH FELLOWSHIP (RF) SCHEME INTRODUCTION The scheme aims to encourage students and teachers to facilitate full research in the University. OBJECTIVE To provide an opportunity to students to undertake research leading to Ph.D in all the domains mainly in Engineering, Management, Sciences, Social Sciences, Education and Law etc. ELIGIBILITY The upper age limit for Research Fellowship (RF): 35 years for men as on 1st January/1 July of the year of application and 45 years for women. The candidates must have at least a first-class master's degree with a second- class bachelor's degree 55% high, or (second-class master's degree (55% & above) with a first-class bachelor's degree). PROCEDURE FOR APPLYING: The applications are invited through circulation or making advertisement in leading news paper. Students who have completed their master's degrees and desire to pursue research may send their applications to the university. PROCEDURE FOR APPROVAL The applications received are placed before a short listing/screening committee constituted for this purpose. The short listed candidates shall be required to appear before the selection committee to finalize the names for the award of RF. The decision of the Vice Chancellor is final and binding. The Ph.D office of the University shall convey the provisional intimation of selection to the candidate. The University reserves the right to withdraw/cancel the award. NATURE OF ASSISTANCE AVAILABLE UNDER THE Fellowship: The number of slots and of the Research Fellowship shall be:  Research Fellowship (RF ): 10 per semester  The maximum tenure of fellowship is 3 years It is expected that the concerned departments will monitor the progress of the Research Fellow on regular basis (at least once a semester). The Fellow should not accept or hold any other position, paid or otherwise, or receive emoluments, salary, stipend etc. from any other"
  },
  {
    "title": "Guidelines for Research Fellowship \\(RF\\) Scheme",
    "start_page": 315,
    "chunk_id": "guidelines-for-research-fellowship-\\rf\\--2",
    "content": "source during the tenure of the award. The fellowship may be terminated at any time during the tenure if and the decision of the University shall be final and binding. The tenure of the fellowship is for a maximum period of 3 years from the date of commencement of course work, subject to satisfactory progress report of the fellow or submission of Ph.D. thesis, whichever is earlier. However, no extension is permissible beyond the total tenure of 3 years. No fellowship is payable after 3 years and no extension is permissible beyond it. The Financial assistance available under the scheme is as follows: Research Fellowship Rs. 31,000/ per month during first two year and Rs. 35,000/- per month in 3rd year. Contingency @ Rs.15,000/-p.a. CONTIGENCY FUND UTILIZATION The utilization of contingency fund is permissible only for the following purposes: (a) Purchase of books/journals/monographs etc. related to the subject of research not available in any of the University Libraries. However such purchase shall be routed through the Central Library of the University for specific utilization by the research assistant for research work only and shall always remain the property of the University (b) Photographic and other media material of relevance required for research (c) Field work and local travel maximum of Rs. 2000/- month on prior approval of reporting officer (d) Computation and analytical charges for consultants (e) Re-prints and Off-prints of relevant research papers (f) Registration fee for attending conferences/seminars in India on prior approval of reporting officer (g) Any other specific research related requirement other than for capital goods and foreign travel, subject to prior approval of the University. Leave: Leave for a maximum period of 30 days in a year in addition to public holidays may be taken by a research fellow with the approval of the supervisor."
  },
  {
    "title": "Guidelines for Research Fellowship \\(RF\\) Scheme",
    "start_page": 315,
    "chunk_id": "guidelines-for-research-fellowship-\\rf\\--3",
    "content": "However, they are not entitled to any other vacations, for example, summer, winter and pooja vacations. Women awardees are eligible for maternity leave at full rates of the fellowships for 135 days as per Government of India rules once during the tenure of their award. The awardee may in special cases may be allowed by the University leave without fellowship/associateship and contingency for a period not exceeding three months during the tenure of award on the recommendation of the supervisor/Head of department of the institution concerned. The period of leave without fellowship/associateship will be counted towards the tenure. PROCEDURE FOR MONITORING THE PROGRESS OF THE RESEARCH FELLOW The progress of the awardee is monitored by the concerned supervisor and DRC. The awardee is required to submit progress report of the work by the end of each semester (May and December duly signed by the supervisor & head of department (DRC Chairperson). Feedback:  After completion of the Research Work the student will submit his/her research work in the INFLIBNET repository along with the research papers published. Outcomes The Research Fellow has to meet the minimum eligibility for publication as laid down in Ph.D Ordinance. Further, it is expected that the research Assistant will be required to publish at least two (2) additional research papers over and above these papers in SCI/ SCOPUS/SSCI/ABDC indexed journals (Clarivate authenticated). The same shall be communicated by the scholar to the office of Doctoral Programs with the copy of publication every year. The Research papers & Thesis must mention the affiliation to the Manav Rachna University. Note: The last 2 installments will be released only after submission of the successfully completing the viva voce Research work in the Repository. Gap Period: The maximum gap period for continuation from M.Phil to Ph.D. under Doctoral Fellowship shall"
  },
  {
    "title": "Guidelines for Research Fellowship \\(RF\\) Scheme",
    "start_page": 315,
    "chunk_id": "guidelines-for-research-fellowship-\\rf\\--4",
    "content": "be 1 year. However the total tenure of fellowship will remain for 3 years. Paid Assignment/Job: The fellow shall not undertake any paid assignment during the tenure of the fellowship (Except in case of leave without fellowship up to one academic year during the entire tenure). OTHER CONDITIONS The Research Fellow, with the consent of the guide/head of department, shall be required to assist the university/institution in its academic work, including tutorials, evaluation of the test papers, laboratory demonstration, supervision of fieldwork, library activities like group seminars and symposia, provided such work as is assigned by HoD in consultation with supervisor but such work should not hinder the research programmes on hand. The total amount of time to be spent on such activities should not exceed ten hours a week. CANCELLATION OF FELLOWSHIP The fellowship is liable to cancellation or withdrawl in case of: • Registration not done within one year from date of joining. • Misconduct; • Unsatisfactory progress of research work/failure in any examination related to M.Phil/Ph.D. or, • He/She is found ineligible later. • Any false information furnished by the applicant or any fraudulent activity by the Scholar/Fellow/Research Awardees shall lead to Penal action against him/her. For Manav Rachna University S/d (Dr. K. Singh) Registrar"
  }
]